------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\new-eth\ethnicity-covid-research/output/log/01_eth_cr_create_analysis_dataset.log
  log type:  text
 opened on:  21 Jul 2020, 11:55:09

. 
. 
. di "STARTING COUNT FROM IMPORT:"
STARTING COUNT FROM IMPORT:

. cou
  21,650,768

. 
. 
. **************************   INPUT REQUIRED   *********************************
. 
. * Censoring dates for each outcome (largely, last date outcome data available)
. global suspected_censor                 = "31/07/2020"  //TPP censor date

. global confirmed_censor                 = "31/07/2020"  //TPP censor date

. global tested_censor                    = "31/07/2020"  //testing data

. global positivetest_censor              = "31/07/2020"  //testing data

. global ae_censor                                = "31/07/2020"  //A&E admission

. global icu_censor                               = "31/07/2020"  //ICU admission 

. global cpnsdeath_censor                 = "31/07/2020"  //in-hospital death

. global onsdeath_censor                  = "31/07/2020"  //all death

. global onscoviddeath_censor             = "31/07/2020"  //all death covid related

. global ons_noncoviddeath_censor         = "31/07/2020"  //all death noncovid related

. 
. 
. foreach i of global outcomes {
  2.         di "`i'" " $`i'_censor"
  3. }
tested 31/07/2020
positivetest 31/07/2020
icu 31/07/2020
cpnsdeath 31/07/2020
onsdeath 31/07/2020
onscoviddeath 31/07/2020
ons_noncoviddeath 31/07/2020

. 
. *Start dates
. global indexdate                        = "01/02/2020"

. 
. 
. /*  Cohort entry and censor dates  */
. * Date of cohort entry, 1 Mar 2020
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. 
. foreach i of global outcomes {
  2.         gen `i'_censor_date             = date("$`i'_censor",   "DMY")
  3.         summ   `i'_censor_date 
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e | 21,650,768       22127           0      22127      22127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positivete~e | 21,650,768       22127           0      22127      22127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
icu_censor~e | 21,650,768       22127           0      22127      22127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cpnsdeath_~e | 21,650,768       22127           0      22127      22127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
onsdeath_c~e | 21,650,768       22127           0      22127      22127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
onscovidde~e | 21,650,768       22127           0      22127      22127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ons_noncov~e | 21,650,768       22127           0      22127      22127

. 
. 
. *******************************************************************************
. 
. 
. 
. /* CREATE VARIABLES===========================================================*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       

.                                                 
. label values ethnicity ethnicity

. tab ethnicity

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 13,060,765       84.43       84.43
                 Mixed |    265,936        1.72       86.15
Asian or Asian British |  1,312,224        8.48       94.64
                 Black |    438,066        2.83       97.47
                 Other |    391,505        2.53      100.00
-----------------------+-----------------------------------
                 Total | 15,468,496      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(8,590,003 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,312,224 real changes made)

.  replace eth5=3 if ethnicity==4
(438,066 real changes made)

.  replace eth5=4 if ethnicity==2
(265,936 real changes made)

.  replace eth5=5 if ethnicity==5
(391,505 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5              1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"       ///
>                                                 5 "Other"                                       ///
>                                         

. 
. label values eth5 eth5

. tab eth5, m

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White | 13,060,765       60.32       60.32
South Asian |  1,312,224        6.06       66.39
      Black |    438,066        2.02       68.41
      Mixed |    265,936        1.23       69.64
      Other |    391,505        1.81       71.45
          . |  6,182,272       28.55      100.00
------------+-----------------------------------
      Total | 21,650,768      100.00

. 
. 
. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(0 real changes made)

. label define ethnicity_16                                                                       ///
>                                                 1 "British or Mixed British"            ///
>                                                 2 "Irish"                                                       ///
>                                                 3 "Other White"                                         ///
>                                                 4 "White + Black Caribbean"             ///
>                                                 5 "White + Black African"                       ///
>                                                 6 "White + Asian"                                       ///
>                                                 7 "Other mixed"                                         ///
>                                                 8 "Indian or British Indian"            ///
>                                                 9 "Pakistani or British Pakistani"      ///
>                                                 10 "Bangladeshi or British Bangladeshi" ///
>                                                 11 "Other Asian"                                        ///
>                                                 12 "Caribbean"                                          ///
>                                                 13 "African"                                            ///
>                                                 14 "Other Black"                                        ///
>                                                 15 "Chinese"                                            ///
>                                                 16 "Other"                                                      

.                                                 
. label values ethnicity_16 ethnicity_16

. tab ethnicity_16,m

                      ethnicity_16 |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
          British or Mixed British | 11,375,257       52.54       52.54
                             Irish |     84,835        0.39       52.93
                       Other White |  1,600,673        7.39       60.32
           White + Black Caribbean |     59,917        0.28       60.60
             White + Black African |     49,760        0.23       60.83
                     White + Asian |     56,377        0.26       61.09
                       Other mixed |     99,882        0.46       61.55
          Indian or British Indian |    523,856        2.42       63.97
    Pakistani or British Pakistani |    414,899        1.92       65.89
Bangladeshi or British Bangladeshi |     96,535        0.45       66.33
                       Other Asian |    276,934        1.28       67.61
                         Caribbean |     94,296        0.44       68.05
                           African |    250,681        1.16       69.21
                       Other Black |     93,089        0.43       69.64
                           Chinese |    117,258        0.54       70.18
                             Other |    274,247        1.27       71.45
                                 . |  6,182,272       28.55      100.00
-----------------------------------+-----------------------------------
                             Total | 21,650,768      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16
(6,182,272 missing values generated)

. recode eth16 4/7 = 99
(eth16: 265936 changes made)

. recode eth16 11 = 16
(eth16: 276934 changes made)

. recode eth16 14 = 16
(eth16: 93089 changes made)

. recode eth16 8 = 4
(eth16: 523856 changes made)

. recode eth16 9 = 5
(eth16: 414899 changes made)

. recode eth16 10 = 6
(eth16: 96535 changes made)

. recode eth16 12 = 7
(eth16: 94296 changes made)

. recode eth16 13 = 8
(eth16: 250681 changes made)

. recode eth16 15 = 9
(eth16: 117258 changes made)

. recode eth16 99 = 10
(eth16: 265936 changes made)

. recode eth16 16 = 11
(eth16: 644270 changes made)

. 
. 
. 
. 
. 
. label define eth16      ///
>                                                 1 "British or Mixed British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///                                     
>                                                 7 "Caribbean" ///
>                                                 8 "African" ///
>                                                 9 "Chinese" ///
>                                                 10 "All mixed" ///
>                                                 11 "All Other" 

. label values eth16 eth16

. tab eth16,m

                   eth16 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
British or Mixed British | 11,375,257       52.54       52.54
                   Irish |     84,835        0.39       52.93
             Other White |  1,600,673        7.39       60.32
                  Indian |    523,856        2.42       62.74
               Pakistani |    414,899        1.92       64.66
             Bangladeshi |     96,535        0.45       65.11
               Caribbean |     94,296        0.44       65.54
                 African |    250,681        1.16       66.70
                 Chinese |    117,258        0.54       67.24
               All mixed |    265,936        1.23       68.47
               All Other |    644,270        2.98       71.45
                       . |  6,182,272       28.55      100.00
-------------------------+-----------------------------------
                   Total | 21,650,768      100.00

. 
. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(21,650,736 missing values generated)

. replace stp = sum(stp)
(21,650,767 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(21,650,768 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(194,516 real changes made, 194,516 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 17128686 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(21650768 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS*******************************************
. 
. 
. *Total number people in household (to check hh size)
. bysort hh_id: gen hh_total=_N

. 
. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(4,220,186 observations deleted)

. 
. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(126 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(260 observations deleted)

. 
. 
. gen male = 1 if sex == "M"
(8,732,061 missing values generated)

. replace male = 0 if sex == "F"
(8,732,061 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. tab male

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |  8,732,061       50.10       50.10
       Male |  8,698,135       49.90      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

. 
. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(17430196 differences between age and age66)

. 
. * Check there are no missing ages
. cap assert age < .

. cap assert agegroup < .

. cap assert age66 < .

. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. 
. /* CONVERT STRINGS TO DATE====================================================*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(17,342,931 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,235,260 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(385,125 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  ///
>                                                 temporary_immunodeficiency  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 combination_bp_meds ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///                                          
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(17,430,196 real changes made)
(16,705,403 real changes made)
(16,705,403 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(17,430,196 real changes made)
(16,224,052 real changes made)
(16,224,052 missing values generated)
variable cancer was str7 now str10
(17,430,196 real changes made)
(16,448,968 real changes made)
(16,448,968 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(17,430,196 real changes made)
(17,341,128 real changes made)
(17,341,128 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(17,430,196 real changes made)
(17,425,363 real changes made)
(17,425,363 missing values generated)
variable chronic_liver_disease was str7 now str10
(17,430,196 real changes made)
(17,325,546 real changes made)
(17,325,546 missing values generated)
variable other_neuro was str7 now str10
(17,430,196 real changes made)
(17,254,858 real changes made)
(17,254,858 missing values generated)
variable stroke was str7 now str10
(17,430,196 real changes made)
(17,049,283 real changes made)
(17,049,283 missing values generated)
variable dementia was str7 now str10
(17,430,196 real changes made)
(17,385,956 real changes made)
(17,385,956 missing values generated)
variable esrf was str7 now str10
(17,430,196 real changes made)
(17,405,009 real changes made)
(17,405,009 missing values generated)
variable hypertension was str7 now str10
(17,430,196 real changes made)
(13,688,957 real changes made)
(13,688,957 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(17,430,196 real changes made)
(16,535,419 real changes made)
(16,535,419 missing values generated)
variable diabetes was str7 now str10
(17,430,196 real changes made)
(15,722,546 real changes made)
(15,722,546 missing values generated)
variable bmi_date_measured was str7 now str10
(17,430,196 real changes made)
(3,581,246 real changes made)
(3,581,246 missing values generated)
variable bp_sys_date_measured was str7 now str10
(17,430,196 real changes made)
(1,722,646 real changes made)
(1,722,646 missing values generated)
variable bp_dias_date_measured was str7 now str10
(17,430,196 real changes made)
(1,724,541 real changes made)
(1,724,541 missing values generated)
variable creatinine_date was str7 now str10
(17,430,196 real changes made)
(4,389,103 real changes made)
(4,389,103 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(17,430,196 real changes made)
(8,083,285 real changes made)
(8,083,285 missing values generated)
variable hba1c_percentage_date was str7 now str10
(17,430,196 real changes made)
(13,417,559 real changes made)
(13,417,559 missing values generated)
variable smoking_status_date was str7 now str10
(17,430,196 real changes made)
(725,408 real changes made)
(725,408 missing values generated)
variable insulin was str7 now str10
(17,430,196 real changes made)
(17,178,226 real changes made)
(17,178,226 missing values generated)
variable statin was str7 now str10
(17,430,196 real changes made)
(14,682,683 real changes made)
(14,682,683 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES====================================================*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 combination_bp_meds ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///                                          
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         tab `newvar'
  6.         
. }

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,705,403       95.84       95.84
          1 |    724,793        4.16      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,224,052       93.08       93.08
          1 |  1,206,144        6.92      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,448,968       94.37       94.37
          1 |    981,228        5.63      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,341,128       99.49       99.49
          1 |     89,068        0.51      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,425,363       99.97       99.97
          1 |      4,833        0.03      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,325,546       99.40       99.40
          1 |    104,650        0.60      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,254,858       98.99       98.99
          1 |    175,338        1.01      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,049,283       97.81       97.81
          1 |    380,913        2.19      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,385,956       99.75       99.75
          1 |     44,240        0.25      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,405,009       99.86       99.86
          1 |     25,187        0.14      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 13,688,957       78.54       78.54
          1 |  3,741,239       21.46      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,535,419       94.87       94.87
          1 |    894,777        5.13      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,581,246       20.55       20.55
          1 | 13,848,950       79.45      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,722,646        9.88        9.88
          1 | 15,707,550       90.12      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,724,541        9.89        9.89
          1 | 15,705,655       90.11      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  4,389,103       25.18       25.18
          1 | 13,041,093       74.82      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,083,285       46.38       46.38
          1 |  9,346,911       53.62      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 13,417,559       76.98       76.98
          1 |  4,012,637       23.02      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    725,408        4.16        4.16
          1 | 16,704,788       95.84      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,178,226       98.55       98.55
          1 |    251,970        1.45      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 14,682,683       84.24       84.24
          1 |  2,747,513       15.76      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 17,430,196      100.00      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(3,633,596 real changes made, 3,633,596 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(127,724 real changes made, 127,724 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(3,581,246 missing values generated)

. gen bmi_age = age - bmi_time
(3,581,246 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(48,140 real changes made, 48,140 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(228,214 real changes made, 228,214 to missing)

. replace bmi_measured = . if bmi == . 
(3,809,460 real changes made, 3,809,460 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(17,430,196 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 307316 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 4790885 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 4721572 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 2403240 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 930029 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 467694 changes made)

. replace bmicat = .u if bmi>=.
(3,809,460 real changes made, 3,809,460 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(17122880 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendation-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(3,809,460 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & ethnicity  ==3
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & ethnicity ==3
(139,783 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 35 & ethnicity ==3
(133,329 real changes made)

. tab bmicat_sa

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    307,316        2.26        2.26
          2 |  4,651,102       34.15       36.40
          3 |  4,728,026       34.71       71.12
          4 |  2,536,569       18.62       89.74
          5 |    930,029        6.83       96.57
          6 |    467,694        3.43      100.00
------------+-----------------------------------
      Total | 13,620,736      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"           ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"      ///
>                                         4 "Obese I (30-34.9 / 27.4-34.9)"               ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(17122880 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-34.9)"               ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(9,427,700 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(5,740,117 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,962,175 real changes made)

. replace smoke = .u if smoking_status == "M"
(725,408 real changes made, 725,408 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(725408 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(16,824,686 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(256,359 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(84,980 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 16483347 changes made)

. label values cancer_cat cancer

. 
. 
. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(17,341,128 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(11,857,150 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,020,763 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(8,049,322 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,754,847 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(1,728,936 real changes made, 1,728,936 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(1728936 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 2232056 changes made)

. 
. 
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(17,341,043 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,249,889 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(385,125 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(15,706,029 real changes made)

. 
. tab dm_type diabetes_type

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |15,706,029          0          0          0 |15,706,029 
         1 |         0     89,153          0          0 |    89,153 
         2 |         0          0  1,249,889          0 | 1,249,889 
         3 |         0          0          0    385,125 |   385,125 
-----------+--------------------------------------------+----------
     Total |15,706,029     89,153  1,249,889    385,125 |17,430,196 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(17,352,475 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,247,966 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(16,104,509 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(4,426,647 real changes made, 4,426,647 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,426,647 missing values generated)

. 
. gen min=.
(17,430,196 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(7,070,100 real changes made)

. replace min = SCr_adj/0.9 if male==1
(5,933,449 real changes made)

. replace min = min^-0.329  if male==0
(7,070,099 real changes made)

. replace min = min^-0.411  if male==1
(5,933,449 real changes made)

. replace min = 1 if min<1
(8,584,726 real changes made)

. 
. gen max=.
(17,430,196 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(7,070,100 real changes made)

. replace max=SCr_adj/0.9 if male==1
(5,933,449 real changes made)

. replace max=max^-1.209
(13,003,548 real changes made)

. replace max=1 if max>1
(8,845,469 real changes made)

. 
. gen egfr=min*max*141
(4,426,647 missing values generated)

. replace egfr=egfr*(0.993^age)
(13,003,549 real changes made)

. replace egfr=egfr*1.018 if male==0
(7,070,100 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(4426647 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(13003549 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(12247905 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(4,426,647 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(15,052,852 real changes made, 15,052,852 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(8,139,397 real changes made, 8,139,397 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |  2,377,344    14.72589    12410.99        .01   1.91e+07
hba1c_mmol~l |  9,290,799     42.2695    2869.758         .4    8688000

. gen     hba1c_pct = hba1c_percentage 
(15,052,852 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(9,290,797 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(757 real changes made, 757 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(9,290,887 real changes made)

. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(9,198,942 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(600,653 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(158,957 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(173,286 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(197,140 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |  8,231,254       87.93       87.93
  >=6.5-7.4 |    600,653        6.42       94.34
  >=7.5-7.9 |    158,957        1.70       96.04
    >=8-8.9 |    173,286        1.85       97.89
        >=9 |    197,140        2.11      100.00
------------+-----------------------------------
      Total |  9,361,290      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(8,598,289 missing values generated)

. replace hba1c75=1 if hba1c_pct>7.5 & hba1c_pct!=.
(469,454 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 17430196 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. **care home
. encode care_home_type, gen(carehome)

. drop care_home_type

. 
. /* OUTCOME AND SURVIVAL TIME==================================================*/
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(17,414,976 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1 
(17,357,037 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES =============================*/
. * Recode to dates from the strings 
. foreach var of global outcomes {
  2.         confirm string variable `var'_date
  3.         rename `var'_date `var'_dstr
  4.         gen `var'_date = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var'_date %td 
  7. 
. }
(16,682,959 missing values generated)
(17,356,521 missing values generated)
(17,428,318 missing values generated)
(17,420,620 missing values generated)
(17,341,817 missing values generated)
(17,414,976 missing values generated)
(17,357,037 missing values generated)

. 
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(17,430,196 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 tab `i'
  5. }
(747,237 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,682,959       95.71       95.71
          1 |    747,237        4.29      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00
(73,675 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,356,521       99.58       99.58
          1 |     73,675        0.42      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00
(1,878 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,428,318       99.99       99.99
          1 |      1,878        0.01      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00
(9,576 real changes made)

  cpnsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,420,620       99.95       99.95
          1 |      9,576        0.05      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00
(88,379 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,341,817       99.49       99.49
          1 |     88,379        0.51      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00
(15,220 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,414,976       99.91       99.91
          1 |     15,220        0.09      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00
(73,159 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,357,037       99.58       99.58
          1 |     73,159        0.42      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

. 
. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dereg_date)
  3. }

. 
. * Format date variables
. format  stime* %td 

. 
. /* LABEL VARIABLES============================================================*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "Number people in household"

. label var  hh_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categories"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date measured"

. label var obese4cat                                     "Obesity (4 categories)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to non)"

. label var imd                                           "Index of Multiple Deprivation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and Transformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var hh_total                                        "calculated No of ppl in household"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicator"

. lab var carehome                                        "Care home type"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_percentage                        "HbA1c %"

. lab var gp_consult_count                        "Number of GP consultations in the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma category"

. lab var asthmacat                                               "Asthma detailed categories"

. label var egfr_cat                                              "Calculated eGFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes by type"

. label var dm_type_exeter_os                             "Diabetes exeter type - OS codelist"

. label var cancer                                                "Cancer"

. label var other_immuno                                  "Immunosuppressed (combination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease"                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"                                                      

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var perm_immunodef                                  "Permanent immunosuppression"

. lab var temp_immunodef                                  "Temporary immunosuppression"

. lab var  bphigh                                                         "non-missing indicator of known high blood pressure"

. lab var bpcat                                                           "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp                                        "High blood pressure or hypertension diagnosis"

. lab var esrf                                                    "end stage renal failure"

. 
. lab var asthma_date                                     "Diagnosed Asthma Date"

. label var hypertension_date                                     "Diagnosed hypertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases Date"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Date"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological disease  Date"

. label var stroke_date                                   "Stroke date"           

. label var dementia_date                                         "DDementia date"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  Date"

. lab var perm_immunodef_date                             "Permanent immunosuppression date"

. lab var temp_immunodef_date                             "Temporary immunosuppression date"

. lab var esrf_date                                                       "end stage renal failure"

. lab var hba1c_mmol_per_mol_date                         "HbA1c mmo/mol_date"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. *medications
. lab var statin                                                          "Statin in last 6 months"

. lab var insulin                                                         "Insulin in last 6 months"

. lab var ace_inhibitors                                          "ACE in last 6 months"

. lab var alpha_blockers                                          "Alpha blocker in last 6 months"

. lab var arbs                                                            "ARB in last 6 months"

. lab var betablockers                                            "Beta blocker in last 6 months"

. lab var calcium_channel_blockers                        "CCB in last 6 months"

. lab var combination_bp_meds                             "BP med in last 6 months"

. lab var spironolactone                                          "Spironolactone in last 6 months"

. lab var thiazide_diuretics                                      "TZD in last 6 months"

. 
. lab var statin_date                                                             "Statin in last 6 months"

. lab var insulin_date                                                            "Insulin in last 6 months"

. lab var ace_inhibitors_date                                             "ACE in last 6 months"

. lab var alpha_blockers_date                                             "Alpha blocker in last 6 months"

. lab var arbs_date                                                               "ARB in last 6 months"

. lab var betablockers_date                                               "Beta blocker in last 6 months"

. lab var calcium_channel_blockers_date                   "CCB in last 6 months"

. lab var combination_bp_meds_date                                "BP med in last 6 months"

. lab var spironolactone_date                                             "Spironolactone in last 6 months"

. lab var thiazide_diuretics_date                                 "TZD in last 6 months"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring for covid TPP cases"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure date: outcome `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
tested_date     float   %td                   Failure date: outcome tested

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date: outcome positivetest

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
icu_date        float   %td                   Failure date: outcome icu

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
cpnsdeath_date  float   %td                   Failure date: outcome cpnsdeath

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date: outcome onsdeath

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date: outcome onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date: outcome ons_noncoviddeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survival time (date);outcome `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_tested    float   %td                   Survival time (date);outcome tested

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survival time (date);outcome positivetest

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_icu       float   %td                   Survival time (date);outcome icu

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_cpnsdeath float   %td                   Survival time (date);outcome cpnsdeath

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survival time (date);outcome onsdeath

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survival time (date);outcome onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survival time (date);outcome ons_noncoviddeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         tab `i'
  4. }

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,682,959       95.71       95.71
          1 |    747,237        4.29      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,356,521       99.58       99.58
          1 |     73,675        0.42      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

outcome icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,428,318       99.99       99.99
          1 |      1,878        0.01      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

    outcome |
  cpnsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,420,620       99.95       99.95
          1 |      9,576        0.05      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,341,817       99.49       99.49
          1 |     88,379        0.51      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,414,976       99.91       99.91
          1 |     15,220        0.09      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,357,037       99.58       99.58
          1 |     73,159        0.42      100.00
------------+-----------------------------------
      Total | 17,430,196      100.00

. label var was_ventilated_flag           "outcome: ICU Ventilation"

. 
. /* TIDY DATA==================================================================*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  primary_c~re  died_ons_c~y  ethnicity     bmi_measured  bp_sys_dat~d  bp_dias_da~d  creatinine    smoki~e_date  diabetes_e~s  bmi_age       min           hba1ccat
primary_c~se  suspected_~e  died_ons_c~g  ethni~y_date  bp_sys        bp_dias       ~l_date_date  crea~te_date  smoki~s_date  diabetes_e~r  cancer_cat    max           hba1c75
primary_ca~_  ae_date       ethni~6_date  has_consul~y  bp_sys_dat~e  bp_dias_da~e  hba1c_perc..  crea~ne_date  diabetes_t~e  bmi_time      SCr_adj       hba1c_pct     dereg_date

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS==================================================*/ 
. 
. count
  17,430,196

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. count
  17,430,196

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if onsdeath_date <= date("$indexdate", "DMY")
(473 observations deleted)

. drop if cpnsdeath_date <= date("$indexdate", "DMY")
(0 observations deleted)

. 
. count 
  17,429,723

. 
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save "$Tempdir/analysis_dataset.dta", replace
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset.dta saved

. 
. **save a version set on each outcome
. 
. foreach i of global outcomes {
  2.         use "$Tempdir/analysis_dataset.dta", clear
  3.         
.         drop if `i'_date <= date("$indexdate", "DMY") 
  4. 
.         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         save "$Tempdir/analysis_dataset_STSET_`i'.dta", replace
  6. }       
(34 observations deleted)

                id:  patient_id
     failure event:  tested != 0 & tested < .
obs. time interval:  (stime_tested[_n-1], stime_tested]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429689  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429689  observations remaining, representing
   17429689  subjects
    747,203  failures in single-failure-per-subject data
 3.0995e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_tested.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  positivetest != 0 & positivetest < .
obs. time interval:  (stime_positivetest[_n-1], stime_positivetest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429723  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429723  observations remaining, representing
   17429723  subjects
     73,675  failures in single-failure-per-subject data
 3.1397e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_positivetest.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  icu != 0 & icu < .
obs. time interval:  (stime_icu[_n-1], stime_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429723  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429723  observations remaining, representing
   17429723  subjects
      1,878  failures in single-failure-per-subject data
 3.1452e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_icu.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429723  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429723  observations remaining, representing
   17429723  subjects
      9,576  failures in single-failure-per-subject data
 3.1453e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_cpnsdeath.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  onsdeath != 0 & onsdeath < .
obs. time interval:  (stime_onsdeath[_n-1], stime_onsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429723  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429723  observations remaining, representing
   17429723  subjects
     87,906  failures in single-failure-per-subject data
 3.1454e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_onsdeath.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429723  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429723  observations remaining, representing
   17429723  subjects
     15,220  failures in single-failure-per-subject data
 3.1454e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_onscoviddeath.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  ons_noncoviddeath != 0 & ons_noncoviddeath < .
obs. time interval:  (stime_ons_noncoviddeath[_n-1], stime_ons_noncoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17429723  total observations
          0  exclusions
------------------------------------------------------------------------------
   17429723  observations remaining, representing
   17429723  subjects
     72,686  failures in single-failure-per-subject data
 3.1454e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file E:\caroline\new-eth\ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_ons_noncoviddeath.dta saved

.         
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\caroline\new-eth\ethnicity-covid-research/output/log/01_eth_cr_create_analysis_dataset.log
  log type:  text
 closed on:  21 Jul 2020, 12:56:26
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
