-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  14 Jan 2021, 12:20:50

. 
. clear

. import delimited ./output/input.csv
(80 vars, 10,000 obs)

. 
. di "STARTING count FROM IMPORT:"
STARTING count FROM IMPORT:

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(2,180 observations deleted)

. count
  7,820

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(3 observations deleted)

. count
  7,817

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(3,962 missing values generated)

. replace male = 0 if sex == "F"
(3,962 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. tab male

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      3,962       50.68       50.68
       Male |      3,855       49.32      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. count
  7,817

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(7,817 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 7817 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,442       69.62       69.62
               4 |      1,628       20.83       90.44
 5 most deprived |        747        9.56      100.00
-----------------+-----------------------------------
           Total |      7,817      100.00

. 
. drop if imd==.u
(0 observations deleted)

. count
  7,817

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(7,500 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(7,496 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(7,502 missing values generated)

. gen onsunderlyingdeath_date= onsdeath_date if died_ons_covid_flag_underlying=
> =1
(7,477 missing values generated)

. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(6,576 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         confirm string variable `var'_date
  3.         rename `var'_date `var'_dstr
  4.         gen `var'_date = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var'_date %td 
  7. 
. }
(6,241 missing values generated)
(6,256 missing values generated)
(6,233 missing values generated)
(5,878 missing values generated)
(7,500 missing values generated)
(7,496 missing values generated)
(7,477 missing values generated)
(6,576 missing values generated)
(6,259 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
icu
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
onsconfirmeddeath
  0
(0 real changes made)
onsunderlyingdeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(7,817 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 tab `i'
  5. }
(1,576 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,241       79.84       79.84
          1 |      1,576       20.16      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,561 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,256       80.03       80.03
          1 |      1,561       19.97      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,584 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,233       79.74       79.74
          1 |      1,584       20.26      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,939 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,878       75.20       75.20
          1 |      1,939       24.80      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(317 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,500       95.94       95.94
          1 |        317        4.06      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(321 real changes made)

onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,496       95.89       95.89
          1 |        321        4.11      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(340 real changes made)

onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,477       95.65       95.65
          1 |        340        4.35      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,241 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,576       84.12       84.12
          1 |      1,241       15.88      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,558 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,259       80.07       80.07
          1 |      1,558       19.93      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("03/08/2020")

. gen positivetest_censor_date = d("03/08/2020")

. gen ae_censor_date = d("03/08/2020")

. gen hes_censor_date = d("03/08/2020")

. gen icu_censor_date = d("30/07/2020")

. gen cpnsdeath_censor_date  = d("03/08/2020")

. gen onsdeath_censor_date = d("03/08/2020")

. gen onscoviddeath_censor_date = d("03/08/2020")

. gen ons_noncoviddeath_censor_date = d("03/08/2020")

. gen onsconfirmeddeath_censor_date=d("03/08/2020")

. gen onsunderlyingdeath_censor_date=d("03/08/2020")

. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |      7,817   03aug2020           0  03aug2020  03aug2020
posit~r_date |      7,817   03aug2020           0  03aug2020  03aug2020
ae_censor_~e |      7,817   03aug2020           0  03aug2020  03aug2020
hes_censor~e |      7,817   03aug2020           0  03aug2020  03aug2020
icu_censor~e |      7,817   30jul2020           0  30jul2020  30jul2020
-------------+---------------------------------------------------------
cpnsd~r_date |      7,817   03aug2020           0  03aug2020  03aug2020
onsdeath_c~e |      7,817   03aug2020           0  03aug2020  03aug2020
onscovidde.. |      7,817   03aug2020           0  03aug2020  03aug2020
ons_n~r_date |      7,817   03aug2020           0  03aug2020  03aug2020
onsconfirm.. |      7,817   03aug2020           0  03aug2020  03aug2020
-------------+---------------------------------------------------------
onsun~r_date |      7,817   03aug2020           0  03aug2020  03aug2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. tab ethnicity, m

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      1,141       14.60       14.60
                 Mixed |      1,209       15.47       30.06
Asian or Asian British |      1,197       15.31       45.38
                 Black |      1,161       14.85       60.23
                 Other |      1,156       14.79       75.02
                     . |      1,953       24.98      100.00
-----------------------+-----------------------------------
                 Total |      7,817      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(6,676 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,197 real changes made)

.  replace eth5=3 if ethnicity==4
(1,161 real changes made)

.  replace eth5=4 if ethnicity==2
(1,209 real changes made)

.  replace eth5=5 if ethnicity==5
(1,156 real changes made)

.  replace eth5=6 if ethnicity==.
(1,953 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. tab eth5, m

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,141       14.60       14.60
South Asian |      1,197       15.31       29.91
      Black |      1,161       14.85       44.76
      Mixed |      1,209       15.47       60.23
      Other |      1,156       14.79       75.02
    Unknown |      1,953       24.98      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(1,915 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. tab ethnicity_16,m

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |        355        4.54        4.54
            Irish |        358        4.58        9.12
      Other White |        394        5.04       14.16
White + Caribbean |        375        4.80       18.96
  White + African |        381        4.87       23.83
    White + Asian |        380        4.86       28.69
      Other mixed |        354        4.53       33.22
           Indian |        379        4.85       38.07
        Pakistani |        390        4.99       43.06
      Bangladeshi |        369        4.72       47.78
      Other Asian |        341        4.36       52.14
        Caribbean |        365        4.67       56.81
          African |        358        4.58       61.39
      Other Black |        349        4.46       65.86
          Chinese |        377        4.82       70.68
            Other |        377        4.82       75.50
          Unknown |      1,915       24.50      100.00
------------------+-----------------------------------
            Total |      7,817      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 1490 changes made)

. recode eth16 8 = 4
(eth16: 379 changes made)

. recode eth16 9 = 5
(eth16: 390 changes made)

. recode eth16 10 = 6
(eth16: 369 changes made)

. recode eth16 11= 7
(eth16: 341 changes made)

. recode eth16 12 = 8
(eth16: 365 changes made)

. recode eth16 13 = 9
(eth16: 358 changes made)

. recode eth16 14 = 10
(eth16: 349 changes made)

. recode eth16 15 = 11
(eth16: 377 changes made)

. recode eth16 99 = 12
(eth16: 1490 changes made)

. recode eth16 16 = 13
(eth16: 377 changes made)

. recode eth16 17 = 14
(eth16: 1915 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. tab eth16,m

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        355        4.54        4.54
      Irish |        358        4.58        9.12
Other White |        394        5.04       14.16
     Indian |        379        4.85       19.01
  Pakistani |        390        4.99       24.00
Bangladeshi |        369        4.72       28.72
Other Asian |        341        4.36       33.08
  Caribbean |        365        4.67       37.75
    African |        358        4.58       42.33
Other Black |        349        4.46       46.80
    Chinese |        377        4.82       51.62
  All mixed |      1,490       19.06       70.68
      Other |        377        4.82       75.50
    Unknown |      1,915       24.50      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. tab eth16 eth5, m

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |        52         52         60         50 |       355 
      Irish |        43         55         51         70 |       358 
Other White |        62         76         53         57 |       394 
     Indian |        52         64         46         61 |       379 
  Pakistani |        80         51         47         62 |       390 
Bangladeshi |        44         49         58         57 |       369 
Other Asian |        50         49         52         58 |       341 
  Caribbean |        52         53         63         57 |       365 
    African |        70         48         46         48 |       358 
Other Black |        59         53         60         53 |       349 
    Chinese |        56         59         55         56 |       377 
  All mixed |       198        235        210        260 |     1,490 
      Other |        51         64         61         49 |       377 
    Unknown |       272        289        299        271 |     1,915 
------------+--------------------------------------------+----------
      Total |     1,141      1,197      1,161      1,209 |     7,817 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |        55         86 |       355 
      Irish |        50         89 |       358 
Other White |        54         92 |       394 
     Indian |        47        109 |       379 
  Pakistani |        59         91 |       390 
Bangladeshi |        60        101 |       369 
Other Asian |        53         79 |       341 
  Caribbean |        59         81 |       365 
    African |        50         96 |       358 
Other Black |        52         72 |       349 
    Chinese |        52         99 |       377 
  All mixed |       227        360 |     1,490 
      Other |        53         99 |       377 
    Unknown |       285        499 |     1,915 
------------+----------------------+----------
      Total |     1,156      1,953 |     7,817 

. bysort eth5: tab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.56        4.56
      Irish |         43        3.77        8.33
Other White |         62        5.43       13.76
     Indian |         52        4.56       18.32
  Pakistani |         80        7.01       25.33
Bangladeshi |         44        3.86       29.18
Other Asian |         50        4.38       33.57
  Caribbean |         52        4.56       38.12
    African |         70        6.13       44.26
Other Black |         59        5.17       49.43
    Chinese |         56        4.91       54.34
  All mixed |        198       17.35       71.69
      Other |         51        4.47       76.16
    Unknown |        272       23.84      100.00
------------+-----------------------------------
      Total |      1,141      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.34        4.34
      Irish |         55        4.59        8.94
Other White |         76        6.35       15.29
     Indian |         64        5.35       20.63
  Pakistani |         51        4.26       24.90
Bangladeshi |         49        4.09       28.99
Other Asian |         49        4.09       33.08
  Caribbean |         53        4.43       37.51
    African |         48        4.01       41.52
Other Black |         53        4.43       45.95
    Chinese |         59        4.93       50.88
  All mixed |        235       19.63       70.51
      Other |         64        5.35       75.86
    Unknown |        289       24.14      100.00
------------+-----------------------------------
      Total |      1,197      100.00

-------------------------------------------------------------------------------
-> eth5 = Black

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         60        5.17        5.17
      Irish |         51        4.39        9.56
Other White |         53        4.57       14.13
     Indian |         46        3.96       18.09
  Pakistani |         47        4.05       22.14
Bangladeshi |         58        5.00       27.13
Other Asian |         52        4.48       31.61
  Caribbean |         63        5.43       37.04
    African |         46        3.96       41.00
Other Black |         60        5.17       46.17
    Chinese |         55        4.74       50.90
  All mixed |        210       18.09       68.99
      Other |         61        5.25       74.25
    Unknown |        299       25.75      100.00
------------+-----------------------------------
      Total |      1,161      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         50        4.14        4.14
      Irish |         70        5.79        9.93
Other White |         57        4.71       14.64
     Indian |         61        5.05       19.69
  Pakistani |         62        5.13       24.81
Bangladeshi |         57        4.71       29.53
Other Asian |         58        4.80       34.33
  Caribbean |         57        4.71       39.04
    African |         48        3.97       43.01
Other Black |         53        4.38       47.39
    Chinese |         56        4.63       52.03
  All mixed |        260       21.51       73.53
      Other |         49        4.05       77.58
    Unknown |        271       22.42      100.00
------------+-----------------------------------
      Total |      1,209      100.00

-------------------------------------------------------------------------------
-> eth5 = Other

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         55        4.76        4.76
      Irish |         50        4.33        9.08
Other White |         54        4.67       13.75
     Indian |         47        4.07       17.82
  Pakistani |         59        5.10       22.92
Bangladeshi |         60        5.19       28.11
Other Asian |         53        4.58       32.70
  Caribbean |         59        5.10       37.80
    African |         50        4.33       42.13
Other Black |         52        4.50       46.63
    Chinese |         52        4.50       51.12
  All mixed |        227       19.64       70.76
      Other |         53        4.58       75.35
    Unknown |        285       24.65      100.00
------------+-----------------------------------
      Total |      1,156      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         86        4.40        4.40
      Irish |         89        4.56        8.96
Other White |         92        4.71       13.67
     Indian |        109        5.58       19.25
  Pakistani |         91        4.66       23.91
Bangladeshi |        101        5.17       29.08
Other Asian |         79        4.05       33.13
  Caribbean |         81        4.15       37.28
    African |         96        4.92       42.19
Other Black |         72        3.69       45.88
    Chinese |         99        5.07       50.95
  All mixed |        360       18.43       69.38
      Other |         99        5.07       74.45
    Unknown |        499       25.55      100.00
------------+-----------------------------------
      Total |      1,953      100.00


. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(7,807 missing values generated)

. replace stp = sum(stp)
(7,816 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(7817 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(1,176 real changes made)

. tab  carehometype carehome, m

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0        417 |       417 
        PN |         0        377 |       377 
        PS |         0        382 |       382 
         U |     6,641          0 |     6,641 
-----------+----------------------+----------
     Total |     6,641      1,176 |     7,817 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [4,11]                       units:  1
         unique values:  8                        missing .:  0/7,817

            tabulation:  Freq.  Value
                            14  4
                           173  5
                         1,062  6
                         2,658  7
                         2,684  8
                         1,053  9
                           162  10
                            11  11

. 
. *gen categories of household size.
. gen hh_total_cat=.
(7,817 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(187 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(7,619 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(11 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(1,176 real changes made)

. 
. 
. *who are people with missing household size
. count if hh_total_cat==.
  0

. count if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |        161    4.919255    .2732937          4          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      6,469    7.551863    .9666557          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         11          11           0         11         11

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,176    7.502551    1.016457          4         10


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. tab hh_total_cat,m

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |        161        2.06        2.06
       6-10 |      6,469       82.76       84.82
        11+ |         11        0.14       84.96
   carehome |      1,176       15.04      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. tab hh_total_cat carehome,m 

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |       161          0 |       161 
      6-10 |     6,469          0 |     6,469 
       11+ |        11          0 |        11 
  carehome |         0      1,176 |     1,176 
-----------+----------------------+----------
     Total |     6,641      1,176 |     7,817 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(11 real changes made, 11 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(0 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |      7,817    2.004249    .1429966   1.386294   2.397895
   hh_linear |      7,817    7.495075    1.042474          4         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(7,770 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(291 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(22 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(7,817 real changes made)
(6,255 real changes made)
(6,255 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(7,817 real changes made)
(6,258 real changes made)
(6,258 missing values generated)
variable cancer was str7 now str10
(7,817 real changes made)
(6,276 real changes made)
(6,276 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(7,817 real changes made)
(6,243 real changes made)
(6,243 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(7,817 real changes made)
(6,246 real changes made)
(6,246 missing values generated)
variable chronic_liver_disease was str7 now str10
(7,817 real changes made)
(6,269 real changes made)
(6,269 missing values generated)
variable other_neuro was str7 now str10
(7,817 real changes made)
(6,284 real changes made)
(6,284 missing values generated)
variable stroke was str7 now str10
(7,817 real changes made)
(6,223 real changes made)
(6,223 missing values generated)
variable dementia was str7 now str10
(7,817 real changes made)
(6,253 real changes made)
(6,253 missing values generated)
variable esrf was str7 now str10
(7,817 real changes made)
(6,259 real changes made)
(6,259 missing values generated)
variable hypertension was str7 now str10
(7,817 real changes made)
(6,256 real changes made)
(6,256 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(7,817 real changes made)
(6,263 real changes made)
(6,263 missing values generated)
variable diabetes was str7 now str10
(7,817 real changes made)
(7,457 real changes made)
(7,457 missing values generated)
variable bmi_date_measured was str7 now str10
(7,817 real changes made)
(377 real changes made)
(377 missing values generated)
variable bp_sys_date_measured was str7 now str10
(7,817 real changes made)
(383 real changes made)
(383 missing values generated)
variable bp_dias_date_measured was str7 now str10
(7,817 real changes made)
(401 real changes made)
(401 missing values generated)
variable creatinine_date was str7 now str10
(7,817 real changes made)
(392 real changes made)
(392 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(7,817 real changes made)
(391 real changes made)
(391 missing values generated)
variable hba1c_percentage_date was str7 now str10
(7,817 real changes made)
(384 real changes made)
(384 missing values generated)
variable smoking_status_date was str7 now str10
(7,817 real changes made)
(6,272 real changes made)
(6,272 missing values generated)
variable insulin was str7 now str10
(7,817 real changes made)
(6,226 real changes made)
(6,226 missing values generated)
variable statin was str7 now str10
(7,817 real changes made)
(6,279 real changes made)
(6,279 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         tab `newvar', m
  6.         
. }

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,255       80.02       80.02
          1 |      1,562       19.98      100.00
------------+-----------------------------------
      Total |      7,817      100.00

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,258       80.06       80.06
          1 |      1,559       19.94      100.00
------------+-----------------------------------
      Total |      7,817      100.00

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,276       80.29       80.29
          1 |      1,541       19.71      100.00
------------+-----------------------------------
      Total |      7,817      100.00

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,243       79.86       79.86
          1 |      1,574       20.14      100.00
------------+-----------------------------------
      Total |      7,817      100.00

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,246       79.90       79.90
          1 |      1,571       20.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,269       80.20       80.20
          1 |      1,548       19.80      100.00
------------+-----------------------------------
      Total |      7,817      100.00

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,284       80.39       80.39
          1 |      1,533       19.61      100.00
------------+-----------------------------------
      Total |      7,817      100.00

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,223       79.61       79.61
          1 |      1,594       20.39      100.00
------------+-----------------------------------
      Total |      7,817      100.00

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,253       79.99       79.99
          1 |      1,564       20.01      100.00
------------+-----------------------------------
      Total |      7,817      100.00

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,259       80.07       80.07
          1 |      1,558       19.93      100.00
------------+-----------------------------------
      Total |      7,817      100.00

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,256       80.03       80.03
          1 |      1,561       19.97      100.00
------------+-----------------------------------
      Total |      7,817      100.00

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,263       80.12       80.12
          1 |      1,554       19.88      100.00
------------+-----------------------------------
      Total |      7,817      100.00

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        377        4.82        4.82
          1 |      7,440       95.18      100.00
------------+-----------------------------------
      Total |      7,817      100.00

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        383        4.90        4.90
          1 |      7,434       95.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        401        5.13        5.13
          1 |      7,416       94.87      100.00
------------+-----------------------------------
      Total |      7,817      100.00

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        392        5.01        5.01
          1 |      7,425       94.99      100.00
------------+-----------------------------------
      Total |      7,817      100.00

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        391        5.00        5.00
          1 |      7,426       95.00      100.00
------------+-----------------------------------
      Total |      7,817      100.00

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        384        4.91        4.91
          1 |      7,433       95.09      100.00
------------+-----------------------------------
      Total |      7,817      100.00

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,272       80.24       80.24
          1 |      1,545       19.76      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,226       79.65       79.65
          1 |      1,591       20.35      100.00
------------+-----------------------------------
      Total |      7,817      100.00

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,279       80.32       80.32
          1 |      1,538       19.68      100.00
------------+-----------------------------------
      Total |      7,817      100.00

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,460       69.85       69.85
          1 |      2,357       30.15      100.00
------------+-----------------------------------
      Total |      7,817      100.00

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,502       70.39       70.39
          1 |      2,315       29.61      100.00
------------+-----------------------------------
      Total |      7,817      100.00

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,480       70.10       70.10
          1 |      2,337       29.90      100.00
------------+-----------------------------------
      Total |      7,817      100.00

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,456       69.80       69.80
          1 |      2,361       30.20      100.00
------------+-----------------------------------
      Total |      7,817      100.00

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,484       70.15       70.15
          1 |      2,333       29.85      100.00
------------+-----------------------------------
      Total |      7,817      100.00

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,467       69.94       69.94
          1 |      2,350       30.06      100.00
------------+-----------------------------------
      Total |      7,817      100.00

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,491       70.24       70.24
          1 |      2,326       29.76      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(708 real changes made, 708 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(377 missing values generated)

. gen bmi_age = age - bmi_time
(377 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(328 real changes made, 328 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(1,036 real changes made, 1,036 to missing)

. replace bmi_measured = . if bmi == . 
(1,413 real changes made, 1,413 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(7,817 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 192 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 787 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 1035 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 1317 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 1314 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 1759 changes made)

. replace bmicat = .u if bmi>=.
(1,413 real changes made, 1,413 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(7625 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(1,413 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(53 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(83 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(102 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(102 real changes made)

. replace bmicat_sa = 7 if bmi==.
(1,413 real changes made)

. 
. tab bmicat_sa

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        192        2.46        2.46
          2 |        734        9.39       11.85
          3 |      1,005       12.86       24.70
          4 |      1,298       16.60       41.31
          5 |      1,314       16.81       58.12
          6 |      1,861       23.81       81.92
          7 |      1,413       18.08      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(6212 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,521 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(159 real changes made)

. replace smoke = 3  if smoking_status == "S"
(915 real changes made)

. replace smoke = .u if smoking_status == "M"
(160 real changes made, 160 to missing)

. replace smoke = .u if smoking_status == "" 
(6,287 real changes made, 6,287 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(6447 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(6,427 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(125 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(26 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 6276 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(6,243 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(2,855 real changes made)

. tab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,962       63.48       63.48
          1 |      2,855       36.52      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50300 (30250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(4 real changes made, 4 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(7,817 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(5 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(7,411 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(770 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(770 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 168 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(770 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(29 real changes made, 29 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(421 missing values generated)

. 
. gen min=.
(7,817 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(3,746 real changes made)

. replace min = SCr_adj/0.9 if male==1
(3,650 real changes made)

. replace min = min^-0.329  if male==0
(3,746 real changes made)

. replace min = min^-0.411  if male==1
(3,650 real changes made)

. replace min = 1 if min<1
(2,004 real changes made)

. 
. gen max=.
(7,817 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(3,746 real changes made)

. replace max=SCr_adj/0.9 if male==1
(3,650 real changes made)

. replace max=max^-1.209
(7,396 real changes made)

. replace max=1 if max>1
(5,813 real changes made)

. 
. gen egfr=min*max*141
(421 missing values generated)

. replace egfr=egfr*(0.993^age)
(7,396 real changes made)

. replace egfr=egfr*1.018 if male==0
(3,746 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(421 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. tab egfr_cat

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |        110        1.49        1.49
Stage 3 egfr 30-6 |      7,286       98.51      100.00
------------------+-----------------------------------
            Total |      7,396      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(110 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |      7,707       98.59       98.59
   eGFR <60 |        110        1.41      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(35 real changes made, 35 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(171 real changes made, 171 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      7,398    5.078346    1.985957   .0085355   11.87057
hba1c_mmol~l |      7,255    40.98353    18.68731   .0153172   118.6232

. gen     hba1c_pct = hba1c_percentage 
(419 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(7,255 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(7,789 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(7,579 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,597 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(144 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(5,838 real changes made)

. 
. tab dm_type diabetes_type

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |     5,838          0          0          0 |     5,838 
         1 |         0        238          0          0 |       238 
         2 |         0          0      1,597          0 |     1,597 
         3 |         0          0          0        144 |       144 
-----------+--------------------------------------------+----------
     Total |     5,838        238      1,597        144 |     7,817 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(7,582 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,492 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(6,090 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(2,894 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(1,445 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(520 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(585 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(316 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(28 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      4,923       62.98       62.98
  >=6.5-7.4 |      1,445       18.49       81.46
  >=7.5-7.9 |        520        6.65       88.12
    >=8-8.9 |        585        7.48       95.60
        >=9 |        316        4.04       99.64
    Unknown |         28        0.36      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(1,449 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(1,421 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. tab hba1c75, m

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,368       81.46       81.46
          1 |      1,421       18.18       99.64
          . |         28        0.36      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,979 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(197 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(41 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(1,299 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(292 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(6 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. tab diabcat, m

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |      5,838       74.68       74.68
  T1DM, controlled |        197        2.52       77.20
T1DM, uncontrolled |         41        0.52       77.73
  T2DM, controlled |      1,299       16.62       94.35
T2DM, uncontrolled |        292        3.74       98.08
Diabetes, no HbA1c |          6        0.08       98.16
                 . |        144        1.84      100.00
-------------------+-----------------------------------
             Total |      7,817      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. tab asthma

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,284       81.68       81.68
          1 |        144        9.16       90.84
          2 |        144        9.16      100.00
------------+-----------------------------------
      Total |      1,572      100.00

. replace asthma=0 if asthma==.
(6,245 real changes made)

. replace asthma=1 if asthma==2
(144 real changes made)

. tab asthma

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,529       96.32       96.32
          1 |        288        3.68      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(1,562 real changes made)
(1,559 real changes made)
(1,541 real changes made)
(1,574 real changes made)
(1,571 real changes made)
(1,548 real changes made)
(1,533 real changes made)
(1,594 real changes made)
(1,564 real changes made)
(1,558 real changes made)
(1,561 real changes made)
(288 real changes made)
(1,554 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |      7,817    2.431495    1.392312          0          9

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(593 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |        502           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,601           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      2,194           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,859           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,661    4.479831    .7463059          4          9


. tab comorbidity_cat,m

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        502        6.42        6.42
          1 |      1,601       20.48       26.90
          2 |      2,194       28.07       54.97
          3 |      1,859       23.78       78.75
          4 |      1,661       21.25      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. tab combination_bp_meds

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
         -4 |          1        0.04        0.04
         -3 |          4        0.17        0.22
         -2 |         12        0.52        0.73
         -1 |         39        1.68        2.41
          0 |        325       13.98       16.39
          1 |        352       15.15       31.54
          2 |        448       19.28       50.82
          3 |        415       17.86       68.67
          4 |        343       14.76       83.43
          5 |        221        9.51       92.94
          6 |        104        4.48       97.42
          7 |         43        1.85       99.27
          8 |         14        0.60       99.87
          9 |          2        0.09       99.96
         10 |          1        0.04      100.00
------------+-----------------------------------
      Total |      2,324      100.00

. replace combination_bp_meds=0 if combination_bp_meds<0 
(56 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(1,591 real changes made)

. tab combination_bp_meds

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        381       16.39       16.39
          1 |      1,943       83.61      100.00
------------+-----------------------------------
      Total |      2,324      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(2,372 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |      7,817    2.503646    2.304599          0         11

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(1,561 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,802       99.81       99.81
          1 |         15        0.19      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,548 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,804       99.83       99.83
          1 |         13        0.17      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,576 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,809       99.90       99.90
          1 |          8        0.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(960 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,838       87.48       87.48
          1 |        979       12.52      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(309 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,809       99.90       99.90
          1 |          8        0.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(320 real changes made)

onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,816       99.99       99.99
          1 |          1        0.01      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(332 real changes made)

onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,809       99.90       99.90
          1 |          8        0.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,229 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,805       99.85       99.85
          1 |         12        0.15      100.00
------------+-----------------------------------
      Total |      7,817      100.00
(1,538 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,797       99.74       99.74
          1 |         20        0.26      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
icu_date        float   %td                   Failure date:  icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsconfi~h_date float   %td                   Failure date:  onsconfirmeddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsunder~h_date float   %td                   Failure date:  onsunderlyingdeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_icu       float   %td                   Survivatime (date): icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsconf~h float   %td                   Survivatime (date):
                                                onsconfirmeddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsunde~h float   %td                   Survivatime (date):
                                                onsunderlyingdeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         tab `i'
  4. }

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,802       99.81       99.81
          1 |         15        0.19      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,804       99.83       99.83
          1 |         13        0.17      100.00
------------+-----------------------------------
      Total |      7,817      100.00

outcome icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,809       99.90       99.90
          1 |          8        0.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,838       87.48       87.48
          1 |        979       12.52      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,809       99.90       99.90
          1 |          8        0.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    outcome |
onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,816       99.99       99.99
          1 |          1        0.01      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    outcome |
onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,809       99.90       99.90
          1 |          8        0.10      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,805       99.85       99.85
          1 |         12        0.15      100.00
------------+-----------------------------------
      Total |      7,817      100.00

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,797       99.74       99.74
          1 |         20        0.26      100.00
------------+-----------------------------------
      Total |      7,817      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~e  hba1c_per~ge  carehometype
primary_c~se  bp_dias_da~e  perm_immun~f  creatinine    bmi_time
primary_c~re  bp_dias_da~d  temp_immun~e  diabetes_t~e  bmi_age
suspected_~e  ~l_date_date  temp_immun~f  diabetes_e~s  cancer_cat
ae_date       hba1c~l_date  died_ons_c..  diabetes_e~r  temp1
cpnsd~h_date  hba1c_perc..  d~nfirmedc~y  index         temp2
ethni~6_date  crea~te_date  died_ons_s~y  onssuspect~e  SCr_adj
ethni~y_date  crea~ne_date  died_ons_c~g  dereg_date    min
bmi_measured  smoki~e_date  ethnicity     ae_censor_~e  max
bp_sys_dat~e  smoki~s_date  has_consul~y  cpnsd~r_date  diabcat

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. count
  7,817

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. count
  7,817

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. count 
  7,817

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> 
> 

end of do-file
