-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  10 Jan 2021, 10:56:26

. 
. clear

. import delimited ./output/input.csv
(80 vars, 10,000 obs)

. 
. di "STARTING safecount FROM IMPORT:"
STARTING safecount FROM IMPORT:

. safecount
  10,000

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(2,143 observations deleted)

. safecount
  7,857

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(0 observations deleted)

. safecount
  7,857

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(3,987 missing values generated)

. replace male = 0 if sex == "F"
(3,987 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      3,987       50.74       50.74
       Male |      3,870       49.26      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. safecount
  7,857

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(7,857 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 7857 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,486       69.82       69.82
               4 |      1,545       19.66       89.49
 5 most deprived |        826       10.51      100.00
-----------------+-----------------------------------
           Total |      7,857      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  7,857

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(7,551 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(7,528 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(7,540 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(6,594 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         confirm string variable `var'_date
  3.         rename `var'_date `var'_dstr
  4.         gen `var'_date = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var'_date %td 
  7. 
. }
(6,272 missing values generated)
(6,290 missing values generated)
(6,267 missing values generated)
(5,875 missing values generated)
(7,551 missing values generated)
(6,594 missing values generated)
(6,288 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
icu
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(7,857 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(1,585 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,272       79.83       79.83
          1 |      1,585       20.17      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,567 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,290       80.06       80.06
          1 |      1,567       19.94      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,590 real changes made)
0

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,267       79.76       79.76
          1 |      1,590       20.24      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,982 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,875       74.77       74.77
          1 |      1,982       25.23      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(306 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,551       96.11       96.11
          1 |        306        3.89      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,263 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,594       83.93       83.93
          1 |      1,263       16.07      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,569 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,288       80.03       80.03
          1 |      1,569       19.97      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("03/08/2020")

. gen positivetest_censor_date = d("03/08/2020")

. gen ae_censor_date = d("03/08/2020")

. gen hes_censor_date = d("03/08/2020")

. gen icu_censor_date = d("30/07/2020")

. gen cpnsdeath_censor_date  = d("03/08/2020")

. gen onsdeath_censor_date = d("03/08/2020")

. gen onscoviddeath_censor_date = d("03/08/2020")

. gen ons_noncoviddeath_censor_date = d("03/08/2020")

. gen onsconfirmeddeath_censor_date=d("03/08/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |      7,857   03aug2020           0  03aug2020  03aug2020
posit~r_date |      7,857   03aug2020           0  03aug2020  03aug2020
ae_censor_~e |      7,857   03aug2020           0  03aug2020  03aug2020
hes_censor~e |      7,857   03aug2020           0  03aug2020  03aug2020
icu_censor~e |      7,857   30jul2020           0  30jul2020  30jul2020
-------------+---------------------------------------------------------
cpnsd~r_date |      7,857   03aug2020           0  03aug2020  03aug2020
onsdeath_c~e |      7,857   03aug2020           0  03aug2020  03aug2020
onscovidde.. |      7,857   03aug2020           0  03aug2020  03aug2020
ons_n~r_date |      7,857   03aug2020           0  03aug2020  03aug2020
onsconfirm.. |      7,857   03aug2020           0  03aug2020  03aug2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      1,186       15.09       15.09
                 Mixed |      1,206       15.35       30.44
Asian or Asian British |      1,220       15.53       45.97
                 Black |      1,153       14.67       60.65
                 Other |      1,133       14.42       75.07
                     . |      1,959       24.93      100.00
-----------------------+-----------------------------------
                 Total |      7,857      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(6,671 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,220 real changes made)

.  replace eth5=3 if ethnicity==4
(1,153 real changes made)

.  replace eth5=4 if ethnicity==2
(1,206 real changes made)

.  replace eth5=5 if ethnicity==5
(1,133 real changes made)

.  replace eth5=6 if ethnicity==.
(1,959 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,186       15.09       15.09
South Asian |      1,220       15.53       30.62
      Black |      1,153       14.67       45.30
      Mixed |      1,206       15.35       60.65
      Other |      1,133       14.42       75.07
    Unknown |      1,959       24.93      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(1,984 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |        351        4.47        4.47
            Irish |        371        4.72        9.19
      Other White |        327        4.16       13.35
White + Caribbean |        334        4.25       17.60
  White + African |        369        4.70       22.30
    White + Asian |        392        4.99       27.29
      Other mixed |        359        4.57       31.86
           Indian |        358        4.56       36.41
        Pakistani |        371        4.72       41.14
      Bangladeshi |        389        4.95       46.09
      Other Asian |        401        5.10       51.19
        Caribbean |        383        4.87       56.06
          African |        369        4.70       60.76
      Other Black |        334        4.25       65.01
          Chinese |        381        4.85       69.86
            Other |        384        4.89       74.75
          Unknown |      1,984       25.25      100.00
------------------+-----------------------------------
            Total |      7,857      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 1454 changes made)

. recode eth16 8 = 4
(eth16: 358 changes made)

. recode eth16 9 = 5
(eth16: 371 changes made)

. recode eth16 10 = 6
(eth16: 389 changes made)

. recode eth16 11= 7
(eth16: 401 changes made)

. recode eth16 12 = 8
(eth16: 383 changes made)

. recode eth16 13 = 9
(eth16: 369 changes made)

. recode eth16 14 = 10
(eth16: 334 changes made)

. recode eth16 15 = 11
(eth16: 381 changes made)

. recode eth16 99 = 12
(eth16: 1454 changes made)

. recode eth16 16 = 13
(eth16: 384 changes made)

. recode eth16 17 = 14
(eth16: 1984 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        351        4.47        4.47
      Irish |        371        4.72        9.19
Other White |        327        4.16       13.35
     Indian |        358        4.56       17.91
  Pakistani |        371        4.72       22.63
Bangladeshi |        389        4.95       27.58
Other Asian |        401        5.10       32.68
  Caribbean |        383        4.87       37.56
    African |        369        4.70       42.26
Other Black |        334        4.25       46.51
    Chinese |        381        4.85       51.36
  All mixed |      1,454       18.51       69.86
      Other |        384        4.89       74.75
    Unknown |      1,984       25.25      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |        55         52         45         70 |       351 
      Irish |        61         60         46         49 |       371 
Other White |        62         39         59         44 |       327 
     Indian |        54         53         50         66 |       358 
  Pakistani |        51         56         61         60 |       371 
Bangladeshi |        48         71         51         61 |       389 
Other Asian |        56         60         62         64 |       401 
  Caribbean |        53         62         66         59 |       383 
    African |        43         56         62         52 |       369 
Other Black |        59         47         50         53 |       334 
    Chinese |        61         58         55         58 |       381 
  All mixed |       234        221        204        215 |     1,454 
      Other |        68         65         59         53 |       384 
    Unknown |       281        320        283        302 |     1,984 
------------+--------------------------------------------+----------
      Total |     1,186      1,220      1,153      1,206 |     7,857 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |        53         76 |       351 
      Irish |        53        102 |       371 
Other White |        50         73 |       327 
     Indian |        41         94 |       358 
  Pakistani |        58         85 |       371 
Bangladeshi |        68         90 |       389 
Other Asian |        47        112 |       401 
  Caribbean |        49         94 |       383 
    African |        60         96 |       369 
Other Black |        43         82 |       334 
    Chinese |        56         93 |       381 
  All mixed |       211        369 |     1,454 
      Other |        48         91 |       384 
    Unknown |       296        502 |     1,984 
------------+----------------------+----------
      Total |     1,133      1,959 |     7,857 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         55        4.64        4.64
      Irish |         61        5.14        9.78
Other White |         62        5.23       15.01
     Indian |         54        4.55       19.56
  Pakistani |         51        4.30       23.86
Bangladeshi |         48        4.05       27.91
Other Asian |         56        4.72       32.63
  Caribbean |         53        4.47       37.10
    African |         43        3.63       40.73
Other Black |         59        4.97       45.70
    Chinese |         61        5.14       50.84
  All mixed |        234       19.73       70.57
      Other |         68        5.73       76.31
    Unknown |        281       23.69      100.00
------------+-----------------------------------
      Total |      1,186      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.26        4.26
      Irish |         60        4.92        9.18
Other White |         39        3.20       12.38
     Indian |         53        4.34       16.72
  Pakistani |         56        4.59       21.31
Bangladeshi |         71        5.82       27.13
Other Asian |         60        4.92       32.05
  Caribbean |         62        5.08       37.13
    African |         56        4.59       41.72
Other Black |         47        3.85       45.57
    Chinese |         58        4.75       50.33
  All mixed |        221       18.11       68.44
      Other |         65        5.33       73.77
    Unknown |        320       26.23      100.00
------------+-----------------------------------
      Total |      1,220      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         45        3.90        3.90
      Irish |         46        3.99        7.89
Other White |         59        5.12       13.01
     Indian |         50        4.34       17.35
  Pakistani |         61        5.29       22.64
Bangladeshi |         51        4.42       27.06
Other Asian |         62        5.38       32.44
  Caribbean |         66        5.72       38.16
    African |         62        5.38       43.54
Other Black |         50        4.34       47.88
    Chinese |         55        4.77       52.65
  All mixed |        204       17.69       70.34
      Other |         59        5.12       75.46
    Unknown |        283       24.54      100.00
------------+-----------------------------------
      Total |      1,153      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         70        5.80        5.80
      Irish |         49        4.06        9.87
Other White |         44        3.65       13.52
     Indian |         66        5.47       18.99
  Pakistani |         60        4.98       23.96
Bangladeshi |         61        5.06       29.02
Other Asian |         64        5.31       34.33
  Caribbean |         59        4.89       39.22
    African |         52        4.31       43.53
Other Black |         53        4.39       47.93
    Chinese |         58        4.81       52.74
  All mixed |        215       17.83       70.56
      Other |         53        4.39       74.96
    Unknown |        302       25.04      100.00
------------+-----------------------------------
      Total |      1,206      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         53        4.68        4.68
      Irish |         53        4.68        9.36
Other White |         50        4.41       13.77
     Indian |         41        3.62       17.39
  Pakistani |         58        5.12       22.51
Bangladeshi |         68        6.00       28.51
Other Asian |         47        4.15       32.66
  Caribbean |         49        4.32       36.98
    African |         60        5.30       42.28
Other Black |         43        3.80       46.07
    Chinese |         56        4.94       51.02
  All mixed |        211       18.62       69.64
      Other |         48        4.24       73.87
    Unknown |        296       26.13      100.00
------------+-----------------------------------
      Total |      1,133      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         76        3.88        3.88
      Irish |        102        5.21        9.09
Other White |         73        3.73       12.81
     Indian |         94        4.80       17.61
  Pakistani |         85        4.34       21.95
Bangladeshi |         90        4.59       26.54
Other Asian |        112        5.72       32.26
  Caribbean |         94        4.80       37.06
    African |         96        4.90       41.96
Other Black |         82        4.19       46.15
    Chinese |         93        4.75       50.89
  All mixed |        369       18.84       69.73
      Other |         91        4.65       74.37
    Unknown |        502       25.63      100.00
------------+-----------------------------------
      Total |      1,959      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(7,847 missing values generated)

. replace stp = sum(stp)
(7,856 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(7857 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(1,189 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0        401 |       401 
        PN |         0        391 |       391 
        PS |         0        397 |       397 
         U |     6,668          0 |     6,668 
-----------+----------------------+----------
     Total |     6,668      1,189 |     7,857 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [4,11]                       units:  1
         unique values:  8                        missing .:  0/7,857

            tabulation:  Freq.  Value
                             7  4
                           181  5
                         1,097  6
                         2,684  7
                         2,685  8
                         1,020  9
                           177  10
                             6  11

. 
. *gen categories of household size.
. gen hh_total_cat=.
(7,857 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(188 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(7,663 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(6 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(1,189 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |        153    4.960784    .1947452          4          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      6,510    7.547773    .9682819          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |          5          11           0         11         11

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,189    7.442389    1.057005          4         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

**TABLE OF hh_total_cat REDACTED DUE TO SMALL N**


. safetab hh_total_cat carehome,m 
22

**TABLE OF hh_total_cat carehome REDACTED DUE TO SMALL N**


. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(5 real changes made, 5 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(0 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |      7,857    2.002776    .1424368   1.386294   2.397895
   hh_linear |      7,857    7.483645     1.04019          4         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(7,801 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(324 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(33 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(7,857 real changes made)
(6,280 real changes made)
(6,280 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(7,857 real changes made)
(6,293 real changes made)
(6,293 missing values generated)
variable cancer was str7 now str10
(7,857 real changes made)
(6,238 real changes made)
(6,238 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(7,857 real changes made)
(6,286 real changes made)
(6,286 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(7,857 real changes made)
(6,293 real changes made)
(6,293 missing values generated)
variable chronic_liver_disease was str7 now str10
(7,857 real changes made)
(6,262 real changes made)
(6,262 missing values generated)
variable other_neuro was str7 now str10
(7,857 real changes made)
(6,283 real changes made)
(6,283 missing values generated)
variable stroke was str7 now str10
(7,857 real changes made)
(6,300 real changes made)
(6,300 missing values generated)
variable dementia was str7 now str10
(7,857 real changes made)
(6,309 real changes made)
(6,309 missing values generated)
variable esrf was str7 now str10
(7,857 real changes made)
(6,279 real changes made)
(6,279 missing values generated)
variable hypertension was str7 now str10
(7,857 real changes made)
(6,289 real changes made)
(6,289 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(7,857 real changes made)
(6,283 real changes made)
(6,283 missing values generated)
variable diabetes was str7 now str10
(7,857 real changes made)
(7,444 real changes made)
(7,444 missing values generated)
variable bmi_date_measured was str7 now str10
(7,857 real changes made)
(393 real changes made)
(393 missing values generated)
variable bp_sys_date_measured was str7 now str10
(7,857 real changes made)
(394 real changes made)
(394 missing values generated)
variable bp_dias_date_measured was str7 now str10
(7,857 real changes made)
(392 real changes made)
(392 missing values generated)
variable creatinine_date was str7 now str10
(7,857 real changes made)
(393 real changes made)
(393 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(7,857 real changes made)
(414 real changes made)
(414 missing values generated)
variable hba1c_percentage_date was str7 now str10
(7,857 real changes made)
(394 real changes made)
(394 missing values generated)
variable smoking_status_date was str7 now str10
(7,857 real changes made)
(6,322 real changes made)
(6,322 missing values generated)
variable insulin was str7 now str10
(7,857 real changes made)
(6,271 real changes made)
(6,271 missing values generated)
variable statin was str7 now str10
(7,857 real changes made)
(6,286 real changes made)
(6,286 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,280       79.93       79.93
          1 |      1,577       20.07      100.00
------------+-----------------------------------
      Total |      7,857      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,293       80.09       80.09
          1 |      1,564       19.91      100.00
------------+-----------------------------------
      Total |      7,857      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,238       79.39       79.39
          1 |      1,619       20.61      100.00
------------+-----------------------------------
      Total |      7,857      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,286       80.01       80.01
          1 |      1,571       19.99      100.00
------------+-----------------------------------
      Total |      7,857      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,293       80.09       80.09
          1 |      1,564       19.91      100.00
------------+-----------------------------------
      Total |      7,857      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,262       79.70       79.70
          1 |      1,595       20.30      100.00
------------+-----------------------------------
      Total |      7,857      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,283       79.97       79.97
          1 |      1,574       20.03      100.00
------------+-----------------------------------
      Total |      7,857      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,300       80.18       80.18
          1 |      1,557       19.82      100.00
------------+-----------------------------------
      Total |      7,857      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,309       80.30       80.30
          1 |      1,548       19.70      100.00
------------+-----------------------------------
      Total |      7,857      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,279       79.92       79.92
          1 |      1,578       20.08      100.00
------------+-----------------------------------
      Total |      7,857      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,289       80.04       80.04
          1 |      1,568       19.96      100.00
------------+-----------------------------------
      Total |      7,857      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,283       79.97       79.97
          1 |      1,574       20.03      100.00
------------+-----------------------------------
      Total |      7,857      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        393        5.00        5.00
          1 |      7,464       95.00      100.00
------------+-----------------------------------
      Total |      7,857      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        394        5.01        5.01
          1 |      7,463       94.99      100.00
------------+-----------------------------------
      Total |      7,857      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        392        4.99        4.99
          1 |      7,465       95.01      100.00
------------+-----------------------------------
      Total |      7,857      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        393        5.00        5.00
          1 |      7,464       95.00      100.00
------------+-----------------------------------
      Total |      7,857      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        414        5.27        5.27
          1 |      7,443       94.73      100.00
------------+-----------------------------------
      Total |      7,857      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        394        5.01        5.01
          1 |      7,463       94.99      100.00
------------+-----------------------------------
      Total |      7,857      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,322       80.46       80.46
          1 |      1,535       19.54      100.00
------------+-----------------------------------
      Total |      7,857      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,271       79.81       79.81
          1 |      1,586       20.19      100.00
------------+-----------------------------------
      Total |      7,857      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,286       80.01       80.01
          1 |      1,571       19.99      100.00
------------+-----------------------------------
      Total |      7,857      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,493       69.91       69.91
          1 |      2,364       30.09      100.00
------------+-----------------------------------
      Total |      7,857      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,484       69.80       69.80
          1 |      2,373       30.20      100.00
------------+-----------------------------------
      Total |      7,857      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,507       70.09       70.09
          1 |      2,350       29.91      100.00
------------+-----------------------------------
      Total |      7,857      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,483       69.78       69.78
          1 |      2,374       30.22      100.00
------------+-----------------------------------
      Total |      7,857      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,506       70.08       70.08
          1 |      2,351       29.92      100.00
------------+-----------------------------------
      Total |      7,857      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,491       69.89       69.89
          1 |      2,366       30.11      100.00
------------+-----------------------------------
      Total |      7,857      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,539       70.50       70.50
          1 |      2,318       29.50      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(687 real changes made, 687 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(393 missing values generated)

. gen bmi_age = age - bmi_time
(393 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(372 real changes made, 372 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(1,059 real changes made, 1,059 to missing)

. replace bmi_measured = . if bmi == . 
(1,452 real changes made, 1,452 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(7,857 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 195 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 744 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 1057 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 1328 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 1367 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 1714 changes made)

. replace bmicat = .u if bmi>=.
(1,452 real changes made, 1,452 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(7662 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(1,452 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(48 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(91 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(105 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(113 real changes made)

. replace bmicat_sa = 7 if bmi==.
(1,452 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        195        2.48        2.48
          2 |        696        8.86       11.34
          3 |      1,014       12.91       24.25
          4 |      1,314       16.72       40.97
          5 |      1,359       17.30       58.27
          6 |      1,827       23.25       81.52
          7 |      1,452       18.48      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(6210 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,551 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(179 real changes made)

. replace smoke = 3  if smoking_status == "S"
(939 real changes made)

. replace smoke = .u if smoking_status == "M"
(143 real changes made, 143 to missing)

. replace smoke = .u if smoking_status == "" 
(6,290 real changes made, 6,290 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(6433 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(6,383 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(103 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(42 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 6238 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(6,286 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(2,802 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,055       64.34       64.34
          1 |      2,802       35.66      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50300 (30250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(9 real changes made, 9 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(7,857 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(11 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(7,454 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(777 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(777 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 159 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(777 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(30 real changes made, 30 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(423 missing values generated)

. 
. gen min=.
(7,857 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(3,771 real changes made)

. replace min = SCr_adj/0.9 if male==1
(3,663 real changes made)

. replace min = min^-0.329  if male==0
(3,771 real changes made)

. replace min = min^-0.411  if male==1
(3,663 real changes made)

. replace min = 1 if min<1
(2,113 real changes made)

. 
. gen max=.
(7,857 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(3,771 real changes made)

. replace max=SCr_adj/0.9 if male==1
(3,663 real changes made)

. replace max=max^-1.209
(7,434 real changes made)

. replace max=1 if max>1
(5,744 real changes made)

. 
. gen egfr=min*max*141
(423 missing values generated)

. replace egfr=egfr*(0.993^age)
(7,434 real changes made)

. replace egfr=egfr*1.018 if male==0
(3,771 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(423 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |         96        1.29        1.29
Stage 3 egfr 30-6 |      7,338       98.71      100.00
------------------+-----------------------------------
            Total |      7,434      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(96 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |      7,761       98.78       98.78
   eGFR <60 |         96        1.22      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(46 real changes made, 46 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(182 real changes made, 182 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      7,417    5.035772    1.966827   .0018614   12.35662
hba1c_mmol~l |      7,261    40.95461    18.90237   .0554647   111.6252

. gen     hba1c_pct = hba1c_percentage 
(440 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(7,261 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(7,819 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(7,594 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,549 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(184 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(5,861 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |     5,861          0          0          0 |     5,861 
         1 |         0        263          0          0 |       263 
         2 |         0          0      1,549          0 |     1,549 
         3 |         0          0          0        184 |       184 
-----------+--------------------------------------------+----------
     Total |     5,861        263      1,549        184 |     7,857 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(7,635 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,529 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(6,106 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(2,872 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(1,436 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(472 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(602 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(324 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(38 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      4,985       63.45       63.45
  >=6.5-7.4 |      1,436       18.28       81.72
  >=7.5-7.9 |        472        6.01       87.73
    >=8-8.9 |        602        7.66       95.39
        >=9 |        324        4.12       99.52
    Unknown |         38        0.48      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(1,436 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(1,398 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,421       81.72       81.72
          1 |      1,398       17.79       99.52
          . |         38        0.48      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,996 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(213 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(48 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(1,253 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(290 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(8 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |      5,861       74.60       74.60
  T1DM, controlled |        213        2.71       77.31
T1DM, uncontrolled |         48        0.61       77.92
  T2DM, controlled |      1,253       15.95       93.87
T2DM, uncontrolled |        290        3.69       97.56
Diabetes, no HbA1c |          8        0.10       97.66
                 . |        184        2.34      100.00
-------------------+-----------------------------------
             Total |      7,857      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,248       79.24       79.24
          1 |        155        9.84       89.08
          2 |        172       10.92      100.00
------------+-----------------------------------
      Total |      1,575      100.00

. replace asthma=0 if asthma==.
(6,282 real changes made)

. replace asthma=1 if asthma==2
(172 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,530       95.84       95.84
          1 |        327        4.16      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(1,577 real changes made)
(1,564 real changes made)
(1,619 real changes made)
(1,571 real changes made)
(1,564 real changes made)
(1,595 real changes made)
(1,574 real changes made)
(1,557 real changes made)
(1,548 real changes made)
(1,578 real changes made)
(1,568 real changes made)
(327 real changes made)
(1,574 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |      7,857    2.445717    1.390756          0          8

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(621 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |        483           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,593           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      2,222           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,889           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,670    4.498204    .7422435          4          8


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        483        6.15        6.15
          1 |      1,593       20.27       26.42
          2 |      2,222       28.28       54.70
          3 |      1,889       24.04       78.75
          4 |      1,670       21.25      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(55 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(1,618 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        383       16.32       16.32
          1 |      1,964       83.68      100.00
------------+-----------------------------------
      Total |      2,347      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(2,374 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |      7,857    2.482245     2.29217          0         11

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(1,569 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,841       99.80       99.80
          1 |         16        0.20      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,550 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,840       99.78       99.78
          1 |         17        0.22      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,574 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,841       99.80       99.80
          1 |         16        0.20      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(917 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,792       86.45       86.45
          1 |      1,065       13.55      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(302 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,853       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,249 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,843       99.82       99.82
          1 |         14        0.18      100.00
------------+-----------------------------------
      Total |      7,857      100.00
(1,551 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,839       99.77       99.77
          1 |         18        0.23      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
icu_date        float   %td                   Failure date:  icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_icu       float   %td                   Survivatime (date): icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,841       99.80       99.80
          1 |         16        0.20      100.00
------------+-----------------------------------
      Total |      7,857      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,840       99.78       99.78
          1 |         17        0.22      100.00
------------+-----------------------------------
      Total |      7,857      100.00
0

outcome icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,841       99.80       99.80
          1 |         16        0.20      100.00
------------+-----------------------------------
      Total |      7,857      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,792       86.45       86.45
          1 |      1,065       13.55      100.00
------------+-----------------------------------
      Total |      7,857      100.00
0

**TABLE OF onscoviddeath REDACTED DUE TO SMALL N**

0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,843       99.82       99.82
          1 |         14        0.18      100.00
------------+-----------------------------------
      Total |      7,857      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,839       99.77       99.77
          1 |         18        0.23      100.00
------------+-----------------------------------
      Total |      7,857      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_age
primary_c~se  bp_dias_da~d  temp_immun~f  diabetes_e~r  cancer_cat
primary_c~re  ~l_date_date  died_ons_c..  index         temp1
suspected_~e  hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp2
ae_date       hba1c_perc..  died_ons_s~y  onssuspect~e  SCr_adj
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    min
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  max
ethni~y_date  smoki~e_date  has_consul~y  cpnsd~r_date  diabcat
bmi_measured  smoki~s_date  hba1c_per~ge  onsconfirm..
bp_sys_dat~e  perm_immun~e  creatinine    carehometype
bp_sys_dat~d  perm_immun~f  diabetes_t~e  bmi_time

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  7,857

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  7,857

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  7,857

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> 
> 

end of do-file
