-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  18 Jan 2021, 13:56:44

. 
. clear

. import delimited ./output/input.csv
(80 vars, 100,000 obs)

. 
. di "STARTING count FROM IMPORT:"
STARTING count FROM IMPORT:

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(20,976 observations deleted)

. count
  79,024

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(9 observations deleted)

. count
  79,015

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(40,188 missing values generated)

. replace male = 0 if sex == "F"
(40,188 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. tab male

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     40,188       50.86       50.86
       Male |     38,827       49.14      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. count
  79,015

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(79,015 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 79015 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     55,177       69.83       69.83
               4 |     15,806       20.00       89.83
 5 most deprived |      8,032       10.17      100.00
-----------------+-----------------------------------
           Total |     79,015      100.00

. 
. drop if imd==.u
(0 observations deleted)

. count
  79,015

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(74,101 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(75,076 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(75,019 missing values generated)

. gen onsunderlyingdeath_date= onsdeath_date if died_ons_covid_flag_underlying=
> =1
(74,169 missing values generated)

. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(64,240 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         confirm string variable `var'_date
  3.         rename `var'_date `var'_dstr
  4.         gen `var'_date = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var'_date %td 
  7. 
. }
(59,238 missing values generated)
(59,232 missing values generated)
(59,310 missing values generated)
(59,315 missing values generated)
(74,101 missing values generated)
(75,076 missing values generated)
(74,169 missing values generated)
(64,240 missing values generated)
(59,326 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
icu
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
onsconfirmeddeath
  0
(0 real changes made)
onsunderlyingdeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(79,015 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 tab `i'
  5. }
(19,777 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,238       74.97       74.97
          1 |     19,777       25.03      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(19,783 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,232       74.96       74.96
          1 |     19,783       25.04      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(19,705 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,310       75.06       75.06
          1 |     19,705       24.94      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(19,700 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,315       75.07       75.07
          1 |     19,700       24.93      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(4,914 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     74,101       93.78       93.78
          1 |      4,914        6.22      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(3,939 real changes made)

onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,076       95.01       95.01
          1 |      3,939        4.99      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(4,846 real changes made)

onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     74,169       93.87       93.87
          1 |      4,846        6.13      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(14,775 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     64,240       81.30       81.30
          1 |     14,775       18.70      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(19,689 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,326       75.08       75.08
          1 |     19,689       24.92      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("03/08/2020")

. gen positivetest_censor_date = d("03/08/2020")

. gen ae_censor_date = d("03/08/2020")

. gen hes_censor_date = d("03/08/2020")

. gen icu_censor_date = d("30/07/2020")

. gen cpnsdeath_censor_date  = d("03/08/2020")

. gen onsdeath_censor_date = d("03/08/2020")

. gen onscoviddeath_censor_date = d("03/08/2020")

. gen ons_noncoviddeath_censor_date = d("03/08/2020")

. gen onsconfirmeddeath_censor_date=d("03/08/2020")

. gen onsunderlyingdeath_censor_date=d("03/08/2020")

. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |     79,015   03aug2020           0  03aug2020  03aug2020
posit~r_date |     79,015   03aug2020           0  03aug2020  03aug2020
ae_censor_~e |     79,015   03aug2020           0  03aug2020  03aug2020
hes_censor~e |     79,015   03aug2020           0  03aug2020  03aug2020
icu_censor~e |     79,015   30jul2020           0  30jul2020  30jul2020
-------------+---------------------------------------------------------
cpnsd~r_date |     79,015   03aug2020           0  03aug2020  03aug2020
onsdeath_c~e |     79,015   03aug2020           0  03aug2020  03aug2020
onscovidde.. |     79,015   03aug2020           0  03aug2020  03aug2020
ons_n~r_date |     79,015   03aug2020           0  03aug2020  03aug2020
onsconfirm.. |     79,015   03aug2020           0  03aug2020  03aug2020
-------------+---------------------------------------------------------
onsun~r_date |     79,015   03aug2020           0  03aug2020  03aug2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. tab ethnicity, m

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     11,950       15.12       15.12
                 Mixed |     11,934       15.10       30.23
Asian or Asian British |     11,643       14.74       44.96
                 Black |     11,898       15.06       60.02
                 Other |     11,842       14.99       75.01
                     . |     19,748       24.99      100.00
-----------------------+-----------------------------------
                 Total |     79,015      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(67,065 missing values generated)

.  replace eth5=2 if ethnicity==3
(11,643 real changes made)

.  replace eth5=3 if ethnicity==4
(11,898 real changes made)

.  replace eth5=4 if ethnicity==2
(11,934 real changes made)

.  replace eth5=5 if ethnicity==5
(11,842 real changes made)

.  replace eth5=6 if ethnicity==.
(19,748 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. tab eth5, m

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,950       15.12       15.12
South Asian |     11,643       14.74       29.86
      Black |     11,898       15.06       44.92
      Mixed |     11,934       15.10       60.02
      Other |     11,842       14.99       75.01
    Unknown |     19,748       24.99      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(19,750 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. tab ethnicity_16,m

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |      3,649        4.62        4.62
            Irish |      3,743        4.74        9.36
      Other White |      3,845        4.87       14.22
White + Caribbean |      3,701        4.68       18.91
  White + African |      3,635        4.60       23.51
    White + Asian |      3,773        4.78       28.28
      Other mixed |      3,756        4.75       33.03
           Indian |      3,705        4.69       37.72
        Pakistani |      3,670        4.64       42.37
      Bangladeshi |      3,684        4.66       47.03
      Other Asian |      3,750        4.75       51.78
        Caribbean |      3,716        4.70       56.48
          African |      3,693        4.67       61.15
      Other Black |      3,711        4.70       65.85
          Chinese |      3,691        4.67       70.52
            Other |      3,543        4.48       75.00
          Unknown |     19,750       25.00      100.00
------------------+-----------------------------------
            Total |     79,015      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 14865 changes made)

. recode eth16 8 = 4
(eth16: 3705 changes made)

. recode eth16 9 = 5
(eth16: 3670 changes made)

. recode eth16 10 = 6
(eth16: 3684 changes made)

. recode eth16 11= 7
(eth16: 3750 changes made)

. recode eth16 12 = 8
(eth16: 3716 changes made)

. recode eth16 13 = 9
(eth16: 3693 changes made)

. recode eth16 14 = 10
(eth16: 3711 changes made)

. recode eth16 15 = 11
(eth16: 3691 changes made)

. recode eth16 99 = 12
(eth16: 14865 changes made)

. recode eth16 16 = 13
(eth16: 3543 changes made)

. recode eth16 17 = 14
(eth16: 19750 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. tab eth16,m

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |      3,649        4.62        4.62
      Irish |      3,743        4.74        9.36
Other White |      3,845        4.87       14.22
     Indian |      3,705        4.69       18.91
  Pakistani |      3,670        4.64       23.56
Bangladeshi |      3,684        4.66       28.22
Other Asian |      3,750        4.75       32.96
  Caribbean |      3,716        4.70       37.67
    African |      3,693        4.67       42.34
Other Black |      3,711        4.70       47.04
    Chinese |      3,691        4.67       51.71
  All mixed |     14,865       18.81       70.52
      Other |      3,543        4.48       75.00
    Unknown |     19,750       25.00      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. tab eth16 eth5, m

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |       588        557        536        526 |     3,649 
      Irish |       546        549        562        597 |     3,743 
Other White |       559        535        596        568 |     3,845 
     Indian |       591        525        561        552 |     3,705 
  Pakistani |       553        534        566        565 |     3,670 
Bangladeshi |       601        513        521        601 |     3,684 
Other Asian |       555        553        583        563 |     3,750 
  Caribbean |       554        555        525        547 |     3,716 
    African |       576        566        542        554 |     3,693 
Other Black |       558        553        570        570 |     3,711 
    Chinese |       565        553        587        524 |     3,691 
  All mixed |     2,234      2,126      2,235      2,260 |    14,865 
      Other |       570        558        529        504 |     3,543 
    Unknown |     2,900      2,966      2,985      3,003 |    19,750 
------------+--------------------------------------------+----------
      Total |    11,950     11,643     11,898     11,934 |    79,015 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |       577        865 |     3,649 
      Irish |       547        942 |     3,743 
Other White |       593        994 |     3,845 
     Indian |       558        918 |     3,705 
  Pakistani |       565        887 |     3,670 
Bangladeshi |       541        907 |     3,684 
Other Asian |       563        933 |     3,750 
  Caribbean |       578        957 |     3,716 
    African |       533        922 |     3,693 
Other Black |       522        938 |     3,711 
    Chinese |       530        932 |     3,691 
  All mixed |     2,262      3,748 |    14,865 
      Other |       519        863 |     3,543 
    Unknown |     2,954      4,942 |    19,750 
------------+----------------------+----------
      Total |    11,842     19,748 |    79,015 

. bysort eth5: tab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        588        4.92        4.92
      Irish |        546        4.57        9.49
Other White |        559        4.68       14.17
     Indian |        591        4.95       19.11
  Pakistani |        553        4.63       23.74
Bangladeshi |        601        5.03       28.77
Other Asian |        555        4.64       33.41
  Caribbean |        554        4.64       38.05
    African |        576        4.82       42.87
Other Black |        558        4.67       47.54
    Chinese |        565        4.73       52.27
  All mixed |      2,234       18.69       70.96
      Other |        570        4.77       75.73
    Unknown |      2,900       24.27      100.00
------------+-----------------------------------
      Total |     11,950      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        557        4.78        4.78
      Irish |        549        4.72        9.50
Other White |        535        4.60       14.09
     Indian |        525        4.51       18.60
  Pakistani |        534        4.59       23.19
Bangladeshi |        513        4.41       27.60
Other Asian |        553        4.75       32.35
  Caribbean |        555        4.77       37.11
    African |        566        4.86       41.97
Other Black |        553        4.75       46.72
    Chinese |        553        4.75       51.47
  All mixed |      2,126       18.26       69.73
      Other |        558        4.79       74.53
    Unknown |      2,966       25.47      100.00
------------+-----------------------------------
      Total |     11,643      100.00

-------------------------------------------------------------------------------
-> eth5 = Black

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        536        4.50        4.50
      Irish |        562        4.72        9.23
Other White |        596        5.01       14.24
     Indian |        561        4.72       18.95
  Pakistani |        566        4.76       23.71
Bangladeshi |        521        4.38       28.09
Other Asian |        583        4.90       32.99
  Caribbean |        525        4.41       37.40
    African |        542        4.56       41.96
Other Black |        570        4.79       46.75
    Chinese |        587        4.93       51.68
  All mixed |      2,235       18.78       70.47
      Other |        529        4.45       74.91
    Unknown |      2,985       25.09      100.00
------------+-----------------------------------
      Total |     11,898      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        526        4.41        4.41
      Irish |        597        5.00        9.41
Other White |        568        4.76       14.17
     Indian |        552        4.63       18.80
  Pakistani |        565        4.73       23.53
Bangladeshi |        601        5.04       28.57
Other Asian |        563        4.72       33.28
  Caribbean |        547        4.58       37.87
    African |        554        4.64       42.51
Other Black |        570        4.78       47.29
    Chinese |        524        4.39       51.68
  All mixed |      2,260       18.94       70.61
      Other |        504        4.22       74.84
    Unknown |      3,003       25.16      100.00
------------+-----------------------------------
      Total |     11,934      100.00

-------------------------------------------------------------------------------
-> eth5 = Other

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        577        4.87        4.87
      Irish |        547        4.62        9.49
Other White |        593        5.01       14.50
     Indian |        558        4.71       19.21
  Pakistani |        565        4.77       23.98
Bangladeshi |        541        4.57       28.55
Other Asian |        563        4.75       33.31
  Caribbean |        578        4.88       38.19
    African |        533        4.50       42.69
Other Black |        522        4.41       47.10
    Chinese |        530        4.48       51.57
  All mixed |      2,262       19.10       70.67
      Other |        519        4.38       75.05
    Unknown |      2,954       24.95      100.00
------------+-----------------------------------
      Total |     11,842      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        865        4.38        4.38
      Irish |        942        4.77        9.15
Other White |        994        5.03       14.18
     Indian |        918        4.65       18.83
  Pakistani |        887        4.49       23.32
Bangladeshi |        907        4.59       27.92
Other Asian |        933        4.72       32.64
  Caribbean |        957        4.85       37.49
    African |        922        4.67       42.16
Other Black |        938        4.75       46.91
    Chinese |        932        4.72       51.63
  All mixed |      3,748       18.98       70.60
      Other |        863        4.37       74.97
    Unknown |      4,942       25.03      100.00
------------+-----------------------------------
      Total |     19,748      100.00


. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(79,005 missing values generated)

. replace stp = sum(stp)
(79,014 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(79015 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(11,860 real changes made)

. tab  carehometype carehome, m

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      3,867 |     3,867 
        PN |         0      3,978 |     3,978 
        PS |         0      4,015 |     4,015 
         U |    67,155          0 |    67,155 
-----------+----------------------+----------
     Total |    67,155     11,860 |    79,015 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,12]                       units:  1
         unique values:  10                       missing .:  0/79,015

                  mean:   7.49689
              std. dev:   1.03978

           percentiles:        10%       25%       50%       75%       90%
                                 6         7         7         8         9

. 
. *gen categories of household size.
. gen hh_total_cat=.
(79,015 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(1,843 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(77,061 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(111 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(11,860 real changes made)

. 
. 
. *who are people with missing household size
. count if hh_total_cat==.
  0

. count if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,542    4.947471    .2289058          3          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     65,515    7.551492    .9623768          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         98    11.03061    .1731504         11         12

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     11,860    7.497555    1.055941          4         12


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. tab hh_total_cat,m

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |      1,542        1.95        1.95
       6-10 |     65,515       82.91       84.87
        11+ |         98        0.12       84.99
   carehome |     11,860       15.01      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. tab hh_total_cat carehome,m 

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |     1,542          0 |     1,542 
      6-10 |    65,515          0 |    65,515 
       11+ |        98          0 |        98 
  carehome |         0     11,860 |    11,860 
-----------+----------------------+----------
     Total |    67,155     11,860 |    79,015 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(98 real changes made, 98 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(4 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |     79,015     2.00457    .1422626   1.098612   2.397895
   hh_linear |     79,015    7.496842    1.039583          3         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(78,560 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(3,242 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(309 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(79,015 real changes made)
(63,216 real changes made)
(63,216 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(79,015 real changes made)
(63,073 real changes made)
(63,073 missing values generated)
variable cancer was str7 now str10
(79,015 real changes made)
(63,256 real changes made)
(63,256 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(79,015 real changes made)
(63,128 real changes made)
(63,128 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(79,015 real changes made)
(63,286 real changes made)
(63,286 missing values generated)
variable chronic_liver_disease was str7 now str10
(79,015 real changes made)
(63,288 real changes made)
(63,288 missing values generated)
variable other_neuro was str7 now str10
(79,015 real changes made)
(63,183 real changes made)
(63,183 missing values generated)
variable stroke was str7 now str10
(79,015 real changes made)
(63,194 real changes made)
(63,194 missing values generated)
variable dementia was str7 now str10
(79,015 real changes made)
(63,154 real changes made)
(63,154 missing values generated)
variable esrf was str7 now str10
(79,015 real changes made)
(63,192 real changes made)
(63,192 missing values generated)
variable hypertension was str7 now str10
(79,015 real changes made)
(63,128 real changes made)
(63,128 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(79,015 real changes made)
(63,270 real changes made)
(63,270 missing values generated)
variable diabetes was str7 now str10
(79,015 real changes made)
(75,009 real changes made)
(75,009 missing values generated)
variable bmi_date_measured was str7 now str10
(79,015 real changes made)
(3,950 real changes made)
(3,950 missing values generated)
variable bp_sys_date_measured was str7 now str10
(79,015 real changes made)
(3,901 real changes made)
(3,901 missing values generated)
variable bp_dias_date_measured was str7 now str10
(79,015 real changes made)
(3,916 real changes made)
(3,916 missing values generated)
variable creatinine_date was str7 now str10
(79,015 real changes made)
(3,966 real changes made)
(3,966 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(79,015 real changes made)
(3,943 real changes made)
(3,943 missing values generated)
variable hba1c_percentage_date was str7 now str10
(79,015 real changes made)
(3,925 real changes made)
(3,925 missing values generated)
variable smoking_status_date was str7 now str10
(79,015 real changes made)
(63,508 real changes made)
(63,508 missing values generated)
variable insulin was str7 now str10
(79,015 real changes made)
(63,224 real changes made)
(63,224 missing values generated)
variable statin was str7 now str10
(79,015 real changes made)
(63,261 real changes made)
(63,261 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         tab `newvar', m
  6.         
. }

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,216       80.01       80.01
          1 |     15,799       19.99      100.00
------------+-----------------------------------
      Total |     79,015      100.00

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,073       79.82       79.82
          1 |     15,942       20.18      100.00
------------+-----------------------------------
      Total |     79,015      100.00

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,256       80.06       80.06
          1 |     15,759       19.94      100.00
------------+-----------------------------------
      Total |     79,015      100.00

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,128       79.89       79.89
          1 |     15,887       20.11      100.00
------------+-----------------------------------
      Total |     79,015      100.00

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,286       80.09       80.09
          1 |     15,729       19.91      100.00
------------+-----------------------------------
      Total |     79,015      100.00

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,288       80.10       80.10
          1 |     15,727       19.90      100.00
------------+-----------------------------------
      Total |     79,015      100.00

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,183       79.96       79.96
          1 |     15,832       20.04      100.00
------------+-----------------------------------
      Total |     79,015      100.00

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,194       79.98       79.98
          1 |     15,821       20.02      100.00
------------+-----------------------------------
      Total |     79,015      100.00

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,154       79.93       79.93
          1 |     15,861       20.07      100.00
------------+-----------------------------------
      Total |     79,015      100.00

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,192       79.97       79.97
          1 |     15,823       20.03      100.00
------------+-----------------------------------
      Total |     79,015      100.00

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,128       79.89       79.89
          1 |     15,887       20.11      100.00
------------+-----------------------------------
      Total |     79,015      100.00

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,270       80.07       80.07
          1 |     15,745       19.93      100.00
------------+-----------------------------------
      Total |     79,015      100.00

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,950        5.00        5.00
          1 |     75,065       95.00      100.00
------------+-----------------------------------
      Total |     79,015      100.00

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,901        4.94        4.94
          1 |     75,114       95.06      100.00
------------+-----------------------------------
      Total |     79,015      100.00

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,916        4.96        4.96
          1 |     75,099       95.04      100.00
------------+-----------------------------------
      Total |     79,015      100.00

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,966        5.02        5.02
          1 |     75,049       94.98      100.00
------------+-----------------------------------
      Total |     79,015      100.00

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,943        4.99        4.99
          1 |     75,072       95.01      100.00
------------+-----------------------------------
      Total |     79,015      100.00

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,925        4.97        4.97
          1 |     75,090       95.03      100.00
------------+-----------------------------------
      Total |     79,015      100.00

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,508       80.37       80.37
          1 |     15,507       19.63      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,224       80.02       80.02
          1 |     15,791       19.98      100.00
------------+-----------------------------------
      Total |     79,015      100.00

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,261       80.06       80.06
          1 |     15,754       19.94      100.00
------------+-----------------------------------
      Total |     79,015      100.00

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,351       70.05       70.05
          1 |     23,664       29.95      100.00
------------+-----------------------------------
      Total |     79,015      100.00

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,328       70.02       70.02
          1 |     23,687       29.98      100.00
------------+-----------------------------------
      Total |     79,015      100.00

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,251       69.92       69.92
          1 |     23,764       30.08      100.00
------------+-----------------------------------
      Total |     79,015      100.00

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,353       70.05       70.05
          1 |     23,662       29.95      100.00
------------+-----------------------------------
      Total |     79,015      100.00

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,335       70.03       70.03
          1 |     23,680       29.97      100.00
------------+-----------------------------------
      Total |     79,015      100.00

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,247       69.92       69.92
          1 |     23,768       30.08      100.00
------------+-----------------------------------
      Total |     79,015      100.00

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,375       70.08       70.08
          1 |     23,640       29.92      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(6,677 real changes made, 6,677 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(3,950 missing values generated)

. gen bmi_age = age - bmi_time
(3,950 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(3,771 real changes made, 3,771 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(10,448 real changes made, 10,448 to missing)

. replace bmi_measured = . if bmi == . 
(14,398 real changes made, 14,398 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(79,015 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 1913 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 7770 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 10652 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 13554 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 13589 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 17139 changes made)

. replace bmicat = .u if bmi>=.
(14,398 real changes made, 14,398 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(77102 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(14,398 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(496 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(891 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(980 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(905 real changes made)

. replace bmicat_sa = 7 if bmi==.
(14,398 real changes made)

. 
. tab bmicat_sa

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,913        2.42        2.42
          2 |      7,274        9.21       11.63
          3 |     10,257       12.98       24.61
          4 |     13,465       17.04       41.65
          5 |     13,664       17.29       58.94
          6 |     18,044       22.84       81.78
          7 |     14,398       18.22      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(62704 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(75,837 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,511 real changes made)

. replace smoke = 3  if smoking_status == "S"
(9,390 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,645 real changes made, 1,645 to missing)

. replace smoke = .u if smoking_status == "" 
(63,291 real changes made, 63,291 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(64936 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(64,812 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(1,258 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(298 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 63256 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(63,128 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(28,486 real changes made)

. tab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,529       63.95       63.95
          1 |     28,486       36.05      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50300 (30250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(115 real changes made, 115 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(79,014 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(79 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(75,019 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(7,741 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(7741 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1553 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(7,741 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(254 real changes made, 254 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,220 missing values generated)

. 
. gen min=.
(79,015 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(38,057 real changes made)

. replace min = SCr_adj/0.9 if male==1
(36,738 real changes made)

. replace min = min^-0.329  if male==0
(38,057 real changes made)

. replace min = min^-0.411  if male==1
(36,738 real changes made)

. replace min = 1 if min<1
(20,761 real changes made)

. 
. gen max=.
(79,015 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(38,057 real changes made)

. replace max=SCr_adj/0.9 if male==1
(36,738 real changes made)

. replace max=max^-1.209
(74,795 real changes made)

. replace max=1 if max>1
(58,254 real changes made)

. 
. gen egfr=min*max*141
(4,220 missing values generated)

. replace egfr=egfr*(0.993^age)
(74,795 real changes made)

. replace egfr=egfr*1.018 if male==0
(38,057 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(4220 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. tab egfr_cat

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |        932        1.25        1.25
Stage 3 egfr 30-6 |     73,863       98.75      100.00
------------------+-----------------------------------
            Total |     74,795      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(932 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |     78,083       98.82       98.82
   eGFR <60 |        932        1.18      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(500 real changes made, 500 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,647 real changes made, 1,647 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     74,590    5.033685    1.952735   .0006737   13.17229
hba1c_mmol~l |     73,425    41.24687     18.8552   .0009959   142.5359

. gen     hba1c_pct = hba1c_percentage 
(4,425 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(73,425 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(78,704 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(76,650 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(15,966 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(1,647 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(59,037 real changes made)

. 
. tab dm_type diabetes_type

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    59,037          0          0          0 |    59,037 
         1 |         0      2,365          0          0 |     2,365 
         2 |         0          0     15,966          0 |    15,966 
         3 |         0          0          0      1,647 |     1,647 
-----------+--------------------------------------------+----------
     Total |    59,037      2,365     15,966      1,647 |    79,015 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(76,696 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(15,787 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(60,909 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(29,139 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(14,217 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(5,018 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(6,145 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(3,449 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(310 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     49,876       63.12       63.12
  >=6.5-7.4 |     14,217       17.99       81.11
  >=7.5-7.9 |      5,018        6.35       87.47
    >=8-8.9 |      6,145        7.78       95.24
        >=9 |      3,449        4.36       99.61
    Unknown |        310        0.39      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(14,922 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(14,612 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. tab hba1c75, m

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     64,093       81.11       81.11
          1 |     14,612       18.49       99.61
          . |        310        0.39      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(19,978 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(1,905 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(454 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(13,066 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(2,858 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(48 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. tab diabcat, m

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     59,037       74.72       74.72
  T1DM, controlled |      1,905        2.41       77.13
T1DM, uncontrolled |        454        0.57       77.70
  T2DM, controlled |     13,066       16.54       94.24
T2DM, uncontrolled |      2,858        3.62       97.85
Diabetes, no HbA1c |         48        0.06       97.92
                 . |      1,647        2.08      100.00
-------------------+-----------------------------------
             Total |     79,015      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. tab asthma

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,473       79.22       79.22
          1 |      1,692       10.75       89.97
          2 |      1,580       10.03      100.00
------------+-----------------------------------
      Total |     15,745      100.00

. replace asthma=0 if asthma==.
(63,270 real changes made)

. replace asthma=1 if asthma==2
(1,580 real changes made)

. tab asthma

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,743       95.86       95.86
          1 |      3,272        4.14      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(15,799 real changes made)
(15,942 real changes made)
(15,759 real changes made)
(15,887 real changes made)
(15,729 real changes made)
(15,727 real changes made)
(15,832 real changes made)
(15,821 real changes made)
(15,861 real changes made)
(15,823 real changes made)
(15,887 real changes made)
(3,272 real changes made)
(15,745 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |     79,015    2.443637    1.400485          0          9

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(6,196 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      5,217           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     15,712           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     22,253           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     18,825           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     17,008    4.491475    .7491499          4          9


. tab comorbidity_cat,m

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,217        6.60        6.60
          1 |     15,712       19.88       26.49
          2 |     22,253       28.16       54.65
          3 |     18,825       23.82       78.47
          4 |     17,008       21.53      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. tab combination_bp_meds

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
         -5 |          1        0.00        0.00
         -4 |          5        0.02        0.03
         -3 |         24        0.10        0.13
         -2 |        119        0.50        0.63
         -1 |        415        1.75        2.38
          0 |      3,218       13.56       15.93
          1 |      3,574       15.06       30.99
          2 |      4,540       19.12       50.11
          3 |      4,489       18.91       69.02
          4 |      3,613       15.22       84.24
          5 |      2,165        9.12       93.36
          6 |      1,028        4.33       97.69
          7 |        414        1.74       99.44
          8 |        106        0.45       99.88
          9 |         26        0.11       99.99
         10 |          2        0.01      100.00
------------+-----------------------------------
      Total |     23,739      100.00

. replace combination_bp_meds=0 if combination_bp_meds<0 
(564 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(16,383 real changes made)

. tab combination_bp_meds

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,782       15.93       15.93
          1 |     19,957       84.07      100.00
------------+-----------------------------------
      Total |     23,739      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(24,135 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |     79,015    2.469531      2.3048          0         12

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(10,222 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,460       87.91       87.91
          1 |      9,555       12.09      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(10,149 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,381       87.81       87.81
          1 |      9,634       12.19      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(10,298 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,608       88.09       88.09
          1 |      9,407       11.91      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(10,085 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,400       87.83       87.83
          1 |      9,615       12.17      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(2,343 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,444       96.75       96.75
          1 |      2,571        3.25      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(1,898 real changes made)

onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,974       97.42       97.42
          1 |      2,041        2.58      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(2,301 real changes made)

onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,470       96.78       96.78
          1 |      2,545        3.22      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(7,055 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     71,295       90.23       90.23
          1 |      7,720        9.77      100.00
------------+-----------------------------------
      Total |     79,015      100.00
(9,398 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,724       86.98       86.98
          1 |     10,291       13.02      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
icu_date        float   %td                   Failure date:  icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsconfi~h_date float   %td                   Failure date:  onsconfirmeddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsunder~h_date float   %td                   Failure date:  onsunderlyingdeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_icu       float   %td                   Survivatime (date): icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsconf~h float   %td                   Survivatime (date):
                                                onsconfirmeddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsunde~h float   %td                   Survivatime (date):
                                                onsunderlyingdeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         tab `i'
  4. }

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,460       87.91       87.91
          1 |      9,555       12.09      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,381       87.81       87.81
          1 |      9,634       12.19      100.00
------------+-----------------------------------
      Total |     79,015      100.00

outcome icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,608       88.09       88.09
          1 |      9,407       11.91      100.00
------------+-----------------------------------
      Total |     79,015      100.00

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,400       87.83       87.83
          1 |      9,615       12.17      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,444       96.75       96.75
          1 |      2,571        3.25      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    outcome |
onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,974       97.42       97.42
          1 |      2,041        2.58      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    outcome |
onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,470       96.78       96.78
          1 |      2,545        3.22      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     71,295       90.23       90.23
          1 |      7,720        9.77      100.00
------------+-----------------------------------
      Total |     79,015      100.00

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,724       86.98       86.98
          1 |     10,291       13.02      100.00
------------+-----------------------------------
      Total |     79,015      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~e  hba1c_per~ge  carehometype
primary_c~se  bp_dias_da~e  perm_immun~f  creatinine    bmi_time
primary_c~re  bp_dias_da~d  temp_immun~e  diabetes_t~e  bmi_age
suspected_~e  ~l_date_date  temp_immun~f  diabetes_e~s  cancer_cat
ae_date       hba1c~l_date  died_ons_c..  diabetes_e~r  temp1
cpnsd~h_date  hba1c_perc..  d~nfirmedc~y  index         temp2
ethni~6_date  crea~te_date  died_ons_s~y  onssuspect~e  SCr_adj
ethni~y_date  crea~ne_date  died_ons_c~g  dereg_date    min
bmi_measured  smoki~e_date  ethnicity     ae_censor_~e  max
bp_sys_dat~e  smoki~s_date  has_consul~y  cpnsd~r_date  diabcat

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. count
  79,015

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. count
  79,015

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. count 
  79,015

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> 
> 

end of do-file
